Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1D014, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D014u)

/** \brief  1D018, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D018u)

/** \brief  1D01C, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D01Cu)

/** \brief  1D020, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D020u)

/** \brief  1D024, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D024u)

/** \brief  1D028, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D028u)

/** \brief  1D02C, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D02Cu)

/** \brief  1D030, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D030u)

/** \brief  1D034, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D034u)

/** \brief  1D038, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D038u)

/** \brief  1D03C, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D03Cu)

/** \brief  1D040, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D040u)

/** \brief  1D044, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D044u)

/** \brief  1D048, CPU Code Protection Range Lower Bound Register */
#define CPU0_CPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D048u)

/** \brief  1D04C, CPU Code Protection Range Upper Bound Register */
#define CPU0_CPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D04Cu)

/** \brief  1FE18, CPU Identification Register TC1.6P */
#define CPU0_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF881FE18u)

/** \brief  1E000, CPU Code Protection Execute Enable Register Set 0 */
#define CPU0_CPXE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_0*)0xF881E000u)

/** \brief  1E004, CPU Code Protection Execute Enable Register Set 1 */
#define CPU0_CPXE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_1*)0xF881E004u)

/** \brief  1E008, CPU Code Protection Execute Enable Register Set 2 */
#define CPU0_CPXE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_2*)0xF881E008u)

/** \brief  1E00C, CPU Code Protection Execute Enable Register Set 3 */
#define CPU0_CPXE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_3*)0xF881E00Cu)

/** \brief  1E050, CPU Code Protection Execute Enable Register Set 4 */
#define CPU0_CPXE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_4*)0xF881E050u)

/** \brief  1E054, CPU Code Protection Execute Enable Register Set 5 */
#define CPU0_CPXE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_5*)0xF881E054u)

/** \brief  1FD0C, CPU Core Register Access Event */
#define CPU0_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF881FD0Cu)

/** \brief  1FE50, CPU Customer ID register */
#define CPU0_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF881FE50u)

/** \brief  1FF00, CPU Data General Purpose Register */
#define CPU0_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF00u)

/** \brief  1FF04, CPU Data General Purpose Register */
#define CPU0_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF04u)

/** \brief  1FF28, CPU Data General Purpose Register */
#define CPU0_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF28u)

/** \brief  1FF2C, CPU Data General Purpose Register */
#define CPU0_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF2Cu)

/** \brief  1FF30, CPU Data General Purpose Register */
#define CPU0_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF30u)

/** \brief  1FF34, CPU Data General Purpose Register */
#define CPU0_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF34u)

/** \brief  1FF38, CPU Data General Purpose Register */
#define CPU0_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF38u)

/** \brief  1FF3C, CPU Data General Purpose Register */
#define CPU0_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF3Cu)

/** \brief  1FF08, CPU Data General Purpose Register */
#define CPU0_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF08u)

/** \brief  1FF0C, CPU Data General Purpose Register */
#define CPU0_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF0Cu)

/** \brief  1FF10, CPU Data General Purpose Register */
#define CPU0_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF10u)

/** \brief  1FF14, CPU Data General Purpose Register */
#define CPU0_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF14u)

/** \brief  1FF18, CPU Data General Purpose Register */
#define CPU0_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF18u)

/** \brief  1FF1C, CPU Data General Purpose Register */
#define CPU0_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF1Cu)

/** \brief  1FF20, CPU Data General Purpose Register */
#define CPU0_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF20u)

/** \brief  1FF24, CPU Data General Purpose Register */
#define CPU0_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF881FF24u)

/** \brief  19018, CPU Data Asynchronous Trap Register */
#define CPU0_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8819018u)

/** \brief  1FD00, CPU Debug Status Register */
#define CPU0_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF881FD00u)

/** \brief  1FD48, CPU Debug Trap Control Register */
#define CPU0_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF881FD48u)

/** \brief  19040, CPU Data Memory Control Register */
#define CPU0_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8819040u)

/** \brief  19000, CPU Data Control Register 2 */
#define CPU0_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8819000u)

