Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1FD44, CPU Debug Context Save Area Pointer */
#define CPU0_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF881FD44u)

/** \brief  1901C, CPU Data Error Address Register */
#define CPU0_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF881901Cu)

/** \brief  19020, CPU Data Integrity Error Address Register */
#define CPU0_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8819020u)

/** \brief  19024, CPU Data Integrity Error Trap Register */
#define CPU0_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8819024u)

/** \brief  E208, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E208u)

/** \brief  E20C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E20Cu)

/** \brief  E200, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E200u)

/** \brief  E204, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E204u)

/** \brief  E218, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E218u)

/** \brief  E21C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E21Cu)

/** \brief  E210, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E210u)

/** \brief  E214, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E214u)

/** \brief  E228, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E228u)

/** \brief  E22C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E22Cu)

/** \brief  E220, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E220u)

/** \brief  E224, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E224u)

/** \brief  E238, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN3_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E238u)

/** \brief  E23C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN3_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E23Cu)

/** \brief  E230, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E230u)

/** \brief  E234, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E234u)

/** \brief  E248, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN4_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E248u)

/** \brief  E24C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN4_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E24Cu)

/** \brief  E240, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E240u)

/** \brief  E244, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E244u)

/** \brief  E258, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN5_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E258u)

/** \brief  E25C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN5_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E25Cu)

/** \brief  E250, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E250u)

/** \brief  E254, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E254u)

/** \brief  E268, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN6_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E268u)

/** \brief  E26C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN6_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E26Cu)

/** \brief  E260, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E260u)

/** \brief  E264, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E264u)

/** \brief  E278, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGN7_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF880E278u)

/** \brief  E27C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGN7_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF880E27Cu)

/** \brief  E270, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU0_DLMU_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF880E270u)

