Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E274, CPU Safety protection DLMU Region Upper Address Register */
#define CPU0_DLMU_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF880E274u)

/** \brief  E288, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA0_R*)0xF880E288u)

/** \brief  E298, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA1_R*)0xF880E298u)

/** \brief  E2A8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA2_R*)0xF880E2A8u)

/** \brief  E2B8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA3_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA3_R*)0xF880E2B8u)

/** \brief  E2C8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA4_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA4_R*)0xF880E2C8u)

/** \brief  E2D8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA5_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA5_R*)0xF880E2D8u)

/** \brief  E2E8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA6_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA6_R*)0xF880E2E8u)

/** \brief  E2F8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU0_DLMU_SPROT_RGNACCENA7_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA7_R*)0xF880E2F8u)

/** \brief  E28C, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB0_R*)0xF880E28Cu)

/** \brief  E29C, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB1_R*)0xF880E29Cu)

/** \brief  E2AC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB2_R*)0xF880E2ACu)

/** \brief  E2BC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB3_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB3_R*)0xF880E2BCu)

/** \brief  E2CC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB4_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB4_R*)0xF880E2CCu)

/** \brief  E2DC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB5_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB5_R*)0xF880E2DCu)

/** \brief  E2EC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB6_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB6_R*)0xF880E2ECu)

/** \brief  E2FC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU0_DLMU_SPROT_RGNACCENB7_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB7_R*)0xF880E2FCu)

/** \brief  1FD40, CPU Debug Monitor Start Address */
#define CPU0_DMS /*lint --e(923)*/ (*(volatile Ifx_CPU_DMS*)0xF881FD40u)

/** \brief  1C000, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C000u)

/** \brief  1C004, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C004u)

/** \brief  1C050, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR10_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C050u)

/** \brief  1C054, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR10_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C054u)

/** \brief  1C058, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR11_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C058u)

/** \brief  1C05C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR11_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C05Cu)

/** \brief  1C060, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR12_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C060u)

/** \brief  1C064, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR12_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C064u)

/** \brief  1C068, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR13_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C068u)

/** \brief  1C06C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR13_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C06Cu)

/** \brief  1C070, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR14_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C070u)

/** \brief  1C074, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR14_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C074u)

/** \brief  1C078, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR15_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C078u)

/** \brief  1C07C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR15_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C07Cu)

/** \brief  1C080, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR16_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C080u)

/** \brief  1C084, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR16_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C084u)

/** \brief  1C088, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR17_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C088u)

/** \brief  1C08C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR17_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C08Cu)

/** \brief  1C008, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C008u)

/** \brief  1C00C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C00Cu)

/** \brief  1C010, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C010u)

/** \brief  1C014, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C014u)

/** \brief  1C018, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C018u)

/** \brief  1C01C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C01Cu)

/** \brief  1C020, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C020u)

/** \brief  1C024, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C024u)

/** \brief  1C028, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C028u)

/** \brief  1C02C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C02Cu)

/** \brief  1C030, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C030u)

/** \brief  1C034, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C034u)

/** \brief  1C038, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C038u)

/** \brief  1C03C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C03Cu)

/** \brief  1C040, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C040u)

/** \brief  1C044, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C044u)

/** \brief  1C048, CPU Data Protection Range, Lower Bound Register */
#define CPU0_DPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C048u)

/** \brief  1C04C, CPU Data Protection Range, Upper Bound Register */
#define CPU0_DPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C04Cu)

/** \brief  1E010, CPU Data Protection Read Enable Register Set 0 */
#define CPU0_DPRE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_0*)0xF881E010u)

/** \brief  1E014, CPU Data Protection Read Enable Register Set 1 */
#define CPU0_DPRE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_1*)0xF881E014u)

/** \brief  1E018, CPU Data Protection Read Enable Register Set 2 */
#define CPU0_DPRE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_2*)0xF881E018u)

