Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E01C, CPU Data Protection Read Enable Register Set 3 */
#define CPU0_DPRE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_3*)0xF881E01Cu)

/** \brief  1E060, CPU Data Protection Read Enable Register Set 4 */
#define CPU0_DPRE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_4*)0xF881E060u)

/** \brief  1E064, CPU Data Protection Read Enable Register Set 5 */
#define CPU0_DPRE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_5*)0xF881E064u)

/** \brief  1E020, CPU Data Protection Write Enable Register Set 0 */
#define CPU0_DPWE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_0*)0xF881E020u)

/** \brief  1E024, CPU Data Protection Write Enable Register Set 1 */
#define CPU0_DPWE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_1*)0xF881E024u)

/** \brief  1E028, CPU Data Protection Write Enable Register Set 2 */
#define CPU0_DPWE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_2*)0xF881E028u)

/** \brief  1E02C, CPU Data Protection Write Enable Register Set 3 */
#define CPU0_DPWE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_3*)0xF881E02Cu)

/** \brief  1E070, CPU Data Protection Write Enable Register Set 4 */
#define CPU0_DPWE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_4*)0xF881E070u)

/** \brief  1E074, CPU Data Protection Write Enable Register Set 5 */
#define CPU0_DPWE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_5*)0xF881E074u)

/** \brief  19010, CPU Data Synchronous Trap Register */
#define CPU0_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF8819010u)

/** \brief  1FD08, CPU External Event Register */
#define CPU0_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF881FD08u)

/** \brief  1FE38, CPU Free CSA List Head Pointer */
#define CPU0_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF881FE38u)

/** \brief  1100, CPU Flash Configuration Register 0 */
#define CPU0_FLASHCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF8801100u)

/** \brief  1104, CPU Flash Configuration Register 1 */
#define CPU0_FLASHCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF8801104u)

/** \brief  1108, CPU Flash Configuration Register 2 */
#define CPU0_FLASHCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF8801108u)

/** \brief  110C, CPU Flash Configuration Register 3 */
#define CPU0_FLASHCON3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF880110Cu)

/** \brief  1A000, CPU Trap Control Register */
#define CPU0_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF881A000u)

/** \brief  1A008, CPU Trapping Instruction Opcode Register */
#define CPU0_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF881A008u)

/** \brief  1A004, CPU Trapping Instruction Program Counter Register */
#define CPU0_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF881A004u)

/** \brief  1A010, CPU Trapping Instruction Operand Register */
#define CPU0_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF881A010u)

/** \brief  1A014, CPU Trapping Instruction Operand Register */
#define CPU0_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF881A014u)

/** \brief  1A018, CPU Trapping Instruction Operand Register */
#define CPU0_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF881A018u)

/** \brief  1FC08, CPU Instruction Count */
#define CPU0_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF881FC08u)

/** \brief  1FE2C, CPU Interrupt Control Register */
#define CPU0_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF881FE2Cu)

/** \brief  1FE28, CPU Interrupt Stack Pointer */
#define CPU0_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF881FE28u)

/** \brief  D000, CPU Reset Register 0 */
#define CPU0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST0*)0xF880D000u)

/** \brief  D004, CPU Reset Register 1 */
#define CPU0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST1*)0xF880D004u)

/** \brief  D008, CPU Reset Status Clear Register */
#define CPU0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF880D008u)

/** \brief  1FE3C, CPU Free CSA List Limit Pointer */
#define CPU0_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF881FE3Cu)

/** \brief  E110, CPU Safety Protection Region LPB Read Access Enable Register A */
#define CPU0_LPB_SPROT_ACCENA_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF880E110u)

/** \brief  E114, CPU Safety Protection Region LPB Read Access Enable Register B */
#define CPU0_LPB_SPROT_ACCENB_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF880E114u)

/** \brief  1FC0C, CPU Multi-Count Register 1 */
#define CPU0_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF881FC0Cu)

/** \brief  1FC10, CPU Multi-Count Register 2 */
#define CPU0_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF881FC10u)

/** \brief  1FC14, CPU Multi-Count Register 3 */
#define CPU0_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF881FC14u)

/** \brief  18, CPU Overlay Mask Register 0 */
#define CPU0_OMASK0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK0*)0xF8800018u)

/** \brief  24, CPU Overlay Mask Register 1 */
#define CPU0_OMASK1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK1*)0xF8800024u)

/** \brief  90, CPU Overlay Mask Register 10 */
#define CPU0_OMASK10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK10*)0xF8800090u)

/** \brief  9C, CPU Overlay Mask Register 11 */
#define CPU0_OMASK11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK11*)0xF880009Cu)

/** \brief  A8, CPU Overlay Mask Register 12 */
#define CPU0_OMASK12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK12*)0xF88000A8u)

/** \brief  B4, CPU Overlay Mask Register 13 */
#define CPU0_OMASK13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK13*)0xF88000B4u)

/** \brief  C0, CPU Overlay Mask Register 14 */
#define CPU0_OMASK14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK14*)0xF88000C0u)

/** \brief  CC, CPU Overlay Mask Register 15 */
#define CPU0_OMASK15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK15*)0xF88000CCu)

/** \brief  D8, CPU Overlay Mask Register 16 */
#define CPU0_OMASK16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK16*)0xF88000D8u)

