Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  64, CPU Redirected Address Base Register 7 */
#define CPU0_RABR7 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR7*)0xF8800064u)

/** \brief  70, CPU Redirected Address Base Register 8 */
#define CPU0_RABR8 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR8*)0xF8800070u)

/** \brief  7C, CPU Redirected Address Base Register 9 */
#define CPU0_RABR9 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR9*)0xF880007Cu)

/** \brief  11030, CPU SRI Error Generation Register */
#define CPU0_SEGEN /*lint --e(923)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8811030u)

/** \brief  E100, CPU Safety Protection Register Access Enable Register A */
#define CPU0_SFR_SPROT_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENA_W*)0xF880E100u)

/** \brief  E104, CPU Safety Protection Region Access Enable Register B */
#define CPU0_SFR_SPROT_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENB_W*)0xF880E104u)

/** \brief  1900C, CPU SIST Mode Access Control Register */
#define CPU0_SMACON /*lint --e(923)*/ (*(volatile Ifx_CPU_SMACON*)0xF881900Cu)

/** \brief  E008, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E008u)

/** \brief  E00C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E00Cu)

/** \brief  E000, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E000u)

/** \brief  E004, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E004u)

/** \brief  E018, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E018u)

/** \brief  E01C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E01Cu)

/** \brief  E010, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E010u)

/** \brief  E014, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E014u)

/** \brief  E028, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E028u)

/** \brief  E02C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E02Cu)

/** \brief  E020, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E020u)

/** \brief  E024, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E024u)

/** \brief  E038, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN3_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E038u)

/** \brief  E03C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN3_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E03Cu)

/** \brief  E030, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E030u)

/** \brief  E034, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E034u)

/** \brief  E048, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN4_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E048u)

/** \brief  E04C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN4_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E04Cu)

/** \brief  E040, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E040u)

/** \brief  E044, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E044u)

/** \brief  E058, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN5_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E058u)

/** \brief  E05C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN5_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E05Cu)

/** \brief  E050, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E050u)

/** \brief  E054, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E054u)

/** \brief  E068, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN6_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E068u)

/** \brief  E06C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN6_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E06Cu)

/** \brief  E060, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E060u)

/** \brief  E064, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E064u)

/** \brief  E078, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU0_SPR_SPROT_RGN7_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF880E078u)

/** \brief  E07C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU0_SPR_SPROT_RGN7_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF880E07Cu)

/** \brief  E070, CPU Safety Protection SPR Region Lower Address Register */
#define CPU0_SPR_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF880E070u)

/** \brief  E074, CPU Safety protection SPR Region Upper Address Register */
#define CPU0_SPR_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF880E074u)

/** \brief  E088, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA0_R*)0xF880E088u)

/** \brief  E098, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA1_R*)0xF880E098u)

/** \brief  E0A8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA2_R*)0xF880E0A8u)

