Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E0B8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA3_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA3_R*)0xF880E0B8u)

/** \brief  E0C8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA4_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA4_R*)0xF880E0C8u)

/** \brief  E0D8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA5_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA5_R*)0xF880E0D8u)

/** \brief  E0E8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA6_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA6_R*)0xF880E0E8u)

/** \brief  E0F8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU0_SPR_SPROT_RGNACCENA7_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA7_R*)0xF880E0F8u)

/** \brief  E08C, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB0_R*)0xF880E08Cu)

/** \brief  E09C, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB1_R*)0xF880E09Cu)

/** \brief  E0AC, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB2_R*)0xF880E0ACu)

/** \brief  E0BC, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB3_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB3_R*)0xF880E0BCu)

/** \brief  E0CC, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB4_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB4_R*)0xF880E0CCu)

/** \brief  E0DC, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB5_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB5_R*)0xF880E0DCu)

/** \brief  E0EC, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB6_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB6_R*)0xF880E0ECu)

/** \brief  E0FC, CPU Safety Protection Region SPR Read Access Enable Register B */
#define CPU0_SPR_SPROT_RGNACCENB7_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENB7_R*)0xF880E0FCu)

/** \brief  1FD10, CPU Software Debug Event */
#define CPU0_SWEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_SWEVT*)0xF881FD10u)

/** \brief  1FE14, CPU System Configuration Register */
#define CPU0_SYSCON /*lint --e(923)*/ (*(volatile Ifx_CPU_SYSCON*)0xF881FE14u)

/** \brief  18004, CPU Task Address Space Identifier Register */
#define CPU0_TASK_ASI /*lint --e(923)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8818004u)

/** \brief  1E400, CPU Temporal Protection System Control Register */
#define CPU0_TPS_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF881E400u)

/** \brief  1E448, CPU Exception Timer Class Enable Register */
#define CPU0_TPS_EXTIM_CLASS_EN /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_EXTIM_CLASS_EN*)0xF881E448u)

/** \brief  1E444, CPU Exception Timer Current Value */
#define CPU0_TPS_EXTIM_CVAL /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_EXTIM_CVAL*)0xF881E444u)

/** \brief  1E450, CPU Exception Timer Status Register */
#define CPU0_TPS_EXTIM_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_EXTIM_FCX*)0xF881E450u)

/** \brief  1E440, CPU Exception Timer Load Value */
#define CPU0_TPS_EXTIM_LVAL /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_EXTIM_LVAL*)0xF881E440u)

/** \brief  1E44C, CPU Exception Timer Status Register */
#define CPU0_TPS_EXTIM_STAT /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_EXTIM_STAT*)0xF881E44Cu)

/** \brief  1E404, CPU Temporal Protection System Timer Register */
#define CPU0_TPS_TIMER0 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF881E404u)

/** \brief  1E408, CPU Temporal Protection System Timer Register */
#define CPU0_TPS_TIMER1 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF881E408u)

/** \brief  1E40C, CPU Temporal Protection System Timer Register */
#define CPU0_TPS_TIMER2 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF881E40Cu)

/** \brief  1F004, CPU Trigger Address */
#define CPU0_TR0_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F004u)

/** \brief  1F000, CPU Trigger Event */
#define CPU0_TR0_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F000u)

/** \brief  1F00C, CPU Trigger Address */
#define CPU0_TR1_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F00Cu)

/** \brief  1F008, CPU Trigger Event */
#define CPU0_TR1_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F008u)

/** \brief  1F014, CPU Trigger Address */
#define CPU0_TR2_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F014u)

/** \brief  1F010, CPU Trigger Event */
#define CPU0_TR2_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F010u)

/** \brief  1F01C, CPU Trigger Address */
#define CPU0_TR3_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F01Cu)

/** \brief  1F018, CPU Trigger Event */
#define CPU0_TR3_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F018u)

/** \brief  1F024, CPU Trigger Address */
#define CPU0_TR4_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F024u)

/** \brief  1F020, CPU Trigger Event */
#define CPU0_TR4_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F020u)

/** \brief  1F02C, CPU Trigger Address */
#define CPU0_TR5_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F02Cu)

/** \brief  1F028, CPU Trigger Event */
#define CPU0_TR5_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F028u)

/** \brief  1F034, CPU Trigger Address */
#define CPU0_TR6_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F034u)

/** \brief  1F030, CPU Trigger Event */
#define CPU0_TR6_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F030u)

/** \brief  1F03C, CPU Trigger Address */
#define CPU0_TR7_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F03Cu)

/** \brief  1F038, CPU Trigger Event */
#define CPU0_TR7_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F038u)

/** \brief  1FD30, CPU Trigger Address x */
#define CPU0_TRIG_ACC /*lint --e(923)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF881FD30u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu1
 * \{  */

/** \brief  1FF80, CPU Address General Purpose Register */
#define CPU1_A0 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF80u)

