Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E4, CPU Overlay Mask Register 17 */
#define CPU1_OMASK17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK17*)0xF88200E4u)

/** \brief  F0, CPU Overlay Mask Register 18 */
#define CPU1_OMASK18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK18*)0xF88200F0u)

/** \brief  FC, CPU Overlay Mask Register 19 */
#define CPU1_OMASK19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK19*)0xF88200FCu)

/** \brief  30, CPU Overlay Mask Register 2 */
#define CPU1_OMASK2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK2*)0xF8820030u)

/** \brief  108, CPU Overlay Mask Register 20 */
#define CPU1_OMASK20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK20*)0xF8820108u)

/** \brief  114, CPU Overlay Mask Register 21 */
#define CPU1_OMASK21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK21*)0xF8820114u)

/** \brief  120, CPU Overlay Mask Register 22 */
#define CPU1_OMASK22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK22*)0xF8820120u)

/** \brief  12C, CPU Overlay Mask Register 23 */
#define CPU1_OMASK23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK23*)0xF882012Cu)

/** \brief  138, CPU Overlay Mask Register 24 */
#define CPU1_OMASK24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK24*)0xF8820138u)

/** \brief  144, CPU Overlay Mask Register 25 */
#define CPU1_OMASK25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK25*)0xF8820144u)

/** \brief  150, CPU Overlay Mask Register 26 */
#define CPU1_OMASK26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK26*)0xF8820150u)

/** \brief  15C, CPU Overlay Mask Register 27 */
#define CPU1_OMASK27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK27*)0xF882015Cu)

/** \brief  168, CPU Overlay Mask Register 28 */
#define CPU1_OMASK28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK28*)0xF8820168u)

/** \brief  174, CPU Overlay Mask Register 29 */
#define CPU1_OMASK29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK29*)0xF8820174u)

/** \brief  3C, CPU Overlay Mask Register 3 */
#define CPU1_OMASK3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK3*)0xF882003Cu)

/** \brief  180, CPU Overlay Mask Register 30 */
#define CPU1_OMASK30 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK30*)0xF8820180u)

/** \brief  18C, CPU Overlay Mask Register 31 */
#define CPU1_OMASK31 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK31*)0xF882018Cu)

/** \brief  48, CPU Overlay Mask Register 4 */
#define CPU1_OMASK4 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK4*)0xF8820048u)

/** \brief  54, CPU Overlay Mask Register 5 */
#define CPU1_OMASK5 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK5*)0xF8820054u)

/** \brief  60, CPU Overlay Mask Register 6 */
#define CPU1_OMASK6 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK6*)0xF8820060u)

/** \brief  6C, CPU Overlay Mask Register 7 */
#define CPU1_OMASK7 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK7*)0xF882006Cu)

/** \brief  78, CPU Overlay Mask Register 8 */
#define CPU1_OMASK8 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK8*)0xF8820078u)

/** \brief  84, CPU Overlay Mask Register 9 */
#define CPU1_OMASK9 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK9*)0xF8820084u)

/** \brief  0, CPU Overlay Range Select Register */
#define CPU1_OSEL /*lint --e(923)*/ (*(volatile Ifx_CPU_OSEL*)0xF8820000u)

/** \brief  14, CPU Overlay Target Address Register 0 */
#define CPU1_OTAR0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR0*)0xF8820014u)

/** \brief  20, CPU Overlay Target Address Register 1 */
#define CPU1_OTAR1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR1*)0xF8820020u)

/** \brief  8C, CPU Overlay Target Address Register 10 */
#define CPU1_OTAR10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR10*)0xF882008Cu)

/** \brief  98, CPU Overlay Target Address Register 11 */
#define CPU1_OTAR11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR11*)0xF8820098u)

/** \brief  A4, CPU Overlay Target Address Register 12 */
#define CPU1_OTAR12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR12*)0xF88200A4u)

/** \brief  B0, CPU Overlay Target Address Register 13 */
#define CPU1_OTAR13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR13*)0xF88200B0u)

/** \brief  BC, CPU Overlay Target Address Register 14 */
#define CPU1_OTAR14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR14*)0xF88200BCu)

/** \brief  C8, CPU Overlay Target Address Register 15 */
#define CPU1_OTAR15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR15*)0xF88200C8u)

/** \brief  D4, CPU Overlay Target Address Register 16 */
#define CPU1_OTAR16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR16*)0xF88200D4u)

/** \brief  E0, CPU Overlay Target Address Register 17 */
#define CPU1_OTAR17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR17*)0xF88200E0u)

/** \brief  EC, CPU Overlay Target Address Register 18 */
#define CPU1_OTAR18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR18*)0xF88200ECu)

/** \brief  F8, CPU Overlay Target Address Register 19 */
#define CPU1_OTAR19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR19*)0xF88200F8u)

/** \brief  2C, CPU Overlay Target Address Register 2 */
#define CPU1_OTAR2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR2*)0xF882002Cu)

/** \brief  104, CPU Overlay Target Address Register 20 */
#define CPU1_OTAR20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR20*)0xF8820104u)

/** \brief  110, CPU Overlay Target Address Register 21 */
#define CPU1_OTAR21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR21*)0xF8820110u)

/** \brief  11C, CPU Overlay Target Address Register 22 */
#define CPU1_OTAR22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR22*)0xF882011Cu)

/** \brief  128, CPU Overlay Target Address Register 23 */
#define CPU1_OTAR23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR23*)0xF8820128u)

/** \brief  134, CPU Overlay Target Address Register 24 */
#define CPU1_OTAR24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR24*)0xF8820134u)

/** \brief  140, CPU Overlay Target Address Register 25 */
#define CPU1_OTAR25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR25*)0xF8820140u)

/** \brief  14C, CPU Overlay Target Address Register 26 */
#define CPU1_OTAR26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR26*)0xF882014Cu)

/** \brief  158, CPU Overlay Target Address Register 27 */
#define CPU1_OTAR27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR27*)0xF8820158u)

/** \brief  164, CPU Overlay Target Address Register 28 */
#define CPU1_OTAR28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR28*)0xF8820164u)

/** \brief  170, CPU Overlay Target Address Register 29 */
#define CPU1_OTAR29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR29*)0xF8820170u)

/** \brief  38, CPU Overlay Target Address Register 3 */
#define CPU1_OTAR3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR3*)0xF8820038u)

