Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  17C, CPU Overlay Target Address Register 30 */
#define CPU1_OTAR30 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR30*)0xF882017Cu)

/** \brief  188, CPU Overlay Target Address Register 31 */
#define CPU1_OTAR31 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR31*)0xF8820188u)

/** \brief  44, CPU Overlay Target Address Register 4 */
#define CPU1_OTAR4 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR4*)0xF8820044u)

/** \brief  50, CPU Overlay Target Address Register 5 */
#define CPU1_OTAR5 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR5*)0xF8820050u)

/** \brief  5C, CPU Overlay Target Address Register 6 */
#define CPU1_OTAR6 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR6*)0xF882005Cu)

/** \brief  68, CPU Overlay Target Address Register 7 */
#define CPU1_OTAR7 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR7*)0xF8820068u)

/** \brief  74, CPU Overlay Target Address Register 8 */
#define CPU1_OTAR8 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR8*)0xF8820074u)

/** \brief  80, CPU Overlay Target Address Register 9 */
#define CPU1_OTAR9 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR9*)0xF8820080u)

/** \brief  1FE08, CPU Program Counter */
#define CPU1_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_PC*)0xF883FE08u)

/** \brief  1920C, CPU Program Control 0 */
#define CPU1_PCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON0*)0xF883920Cu)

/** \brief  19204, CPU Program Control 1 */
#define CPU1_PCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON1*)0xF8839204u)

/** \brief  19208, CPU Program Control 2 */
#define CPU1_PCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON2*)0xF8839208u)

/** \brief  1FE00, CPU Previous Context Information Register */
#define CPU1_PCXI /*lint --e(923)*/ (*(volatile Ifx_CPU_PCXI*)0xF883FE00u)

/** \brief  19210, CPU Program Integrity Error Address Register */
#define CPU1_PIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8839210u)

/** \brief  19214, CPU Program Integrity Error Trap Register */
#define CPU1_PIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIETR*)0xF8839214u)

/** \brief  18100, CPU Data Access CacheabilityRegister */
#define CPU1_PMA0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA0*)0xF8838100u)

/** \brief  18104, CPU Code Access CacheabilityRegister */
#define CPU1_PMA1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA1*)0xF8838104u)

/** \brief  18108, CPU Peripheral Space Identifier register */
#define CPU1_PMA2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA2*)0xF8838108u)

/** \brief  19200, CPU Program Synchronous Trap Register */
#define CPU1_PSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_PSTR*)0xF8839200u)

/** \brief  1FE04, CPU Program Status Word */
#define CPU1_PSW /*lint --e(923)*/ (*(volatile Ifx_CPU_PSW*)0xF883FE04u)

/** \brief  10, CPU Redirected Address Base Register 0 */
#define CPU1_RABR0 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR0*)0xF8820010u)

/** \brief  1C, CPU Redirected Address Base Register 1 */
#define CPU1_RABR1 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR1*)0xF882001Cu)

/** \brief  88, CPU Redirected Address Base Register 10 */
#define CPU1_RABR10 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR10*)0xF8820088u)

/** \brief  94, CPU Redirected Address Base Register 11 */
#define CPU1_RABR11 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR11*)0xF8820094u)

/** \brief  A0, CPU Redirected Address Base Register 12 */
#define CPU1_RABR12 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR12*)0xF88200A0u)

/** \brief  AC, CPU Redirected Address Base Register 13 */
#define CPU1_RABR13 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR13*)0xF88200ACu)

/** \brief  B8, CPU Redirected Address Base Register 14 */
#define CPU1_RABR14 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR14*)0xF88200B8u)

/** \brief  C4, CPU Redirected Address Base Register 15 */
#define CPU1_RABR15 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR15*)0xF88200C4u)

/** \brief  D0, CPU Redirected Address Base Register 16 */
#define CPU1_RABR16 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR16*)0xF88200D0u)

/** \brief  DC, CPU Redirected Address Base Register 17 */
#define CPU1_RABR17 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR17*)0xF88200DCu)

/** \brief  E8, CPU Redirected Address Base Register 18 */
#define CPU1_RABR18 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR18*)0xF88200E8u)

/** \brief  F4, CPU Redirected Address Base Register 19 */
#define CPU1_RABR19 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR19*)0xF88200F4u)

/** \brief  28, CPU Redirected Address Base Register 2 */
#define CPU1_RABR2 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR2*)0xF8820028u)

/** \brief  100, CPU Redirected Address Base Register 20 */
#define CPU1_RABR20 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR20*)0xF8820100u)

/** \brief  10C, CPU Redirected Address Base Register 21 */
#define CPU1_RABR21 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR21*)0xF882010Cu)

/** \brief  118, CPU Redirected Address Base Register 22 */
#define CPU1_RABR22 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR22*)0xF8820118u)

/** \brief  124, CPU Redirected Address Base Register 23 */
#define CPU1_RABR23 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR23*)0xF8820124u)

/** \brief  130, CPU Redirected Address Base Register 24 */
#define CPU1_RABR24 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR24*)0xF8820130u)

/** \brief  13C, CPU Redirected Address Base Register 25 */
#define CPU1_RABR25 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR25*)0xF882013Cu)

/** \brief  148, CPU Redirected Address Base Register 26 */
#define CPU1_RABR26 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR26*)0xF8820148u)

/** \brief  154, CPU Redirected Address Base Register 27 */
#define CPU1_RABR27 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR27*)0xF8820154u)

/** \brief  160, CPU Redirected Address Base Register 28 */
#define CPU1_RABR28 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR28*)0xF8820160u)

/** \brief  16C, CPU Redirected Address Base Register 29 */
#define CPU1_RABR29 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR29*)0xF882016Cu)

/** \brief  34, CPU Redirected Address Base Register 3 */
#define CPU1_RABR3 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR3*)0xF8820034u)

/** \brief  178, CPU Redirected Address Base Register 30 */
#define CPU1_RABR30 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR30*)0xF8820178u)

/** \brief  184, CPU Redirected Address Base Register 31 */
#define CPU1_RABR31 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR31*)0xF8820184u)

/** \brief  40, CPU Redirected Address Base Register 4 */
#define CPU1_RABR4 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR4*)0xF8820040u)

/** \brief  4C, CPU Redirected Address Base Register 5 */
#define CPU1_RABR5 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR5*)0xF882004Cu)

/** \brief  58, CPU Redirected Address Base Register 6 */
#define CPU1_RABR6 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR6*)0xF8820058u)

