Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  64, CPU Redirected Address Base Register 7 */
#define CPU1_RABR7 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR7*)0xF8820064u)

/** \brief  70, CPU Redirected Address Base Register 8 */
#define CPU1_RABR8 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR8*)0xF8820070u)

/** \brief  7C, CPU Redirected Address Base Register 9 */
#define CPU1_RABR9 /*lint --e(923)*/ (*(volatile Ifx_CPU_RABR9*)0xF882007Cu)

/** \brief  11030, CPU SRI Error Generation Register */
#define CPU1_SEGEN /*lint --e(923)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8831030u)

/** \brief  E100, CPU Safety Protection Register Access Enable Register A */
#define CPU1_SFR_SPROT_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENA_W*)0xF882E100u)

/** \brief  E104, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SFR_SPROT_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SFR_SPROT_ACCENB_W*)0xF882E104u)

/** \brief  1900C, CPU SIST Mode Access Control Register */
#define CPU1_SMACON /*lint --e(923)*/ (*(volatile Ifx_CPU_SMACON*)0xF883900Cu)

/** \brief  E008, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E008u)

/** \brief  E00C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E00Cu)

/** \brief  E000, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E000u)

/** \brief  E004, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E004u)

/** \brief  E018, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E018u)

/** \brief  E01C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E01Cu)

/** \brief  E010, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E010u)

/** \brief  E014, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E014u)

/** \brief  E028, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E028u)

/** \brief  E02C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E02Cu)

/** \brief  E020, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E020u)

/** \brief  E024, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E024u)

/** \brief  E038, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN3_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E038u)

/** \brief  E03C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN3_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E03Cu)

/** \brief  E030, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E030u)

/** \brief  E034, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E034u)

/** \brief  E048, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN4_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E048u)

/** \brief  E04C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN4_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E04Cu)

/** \brief  E040, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E040u)

/** \brief  E044, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E044u)

/** \brief  E058, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN5_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E058u)

/** \brief  E05C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN5_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E05Cu)

/** \brief  E050, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E050u)

/** \brief  E054, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E054u)

/** \brief  E068, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN6_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E068u)

/** \brief  E06C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN6_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E06Cu)

/** \brief  E060, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E060u)

/** \brief  E064, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E064u)

/** \brief  E078, CPU Safety Protection Region SPR Write Access Enable Register
 * A */
#define CPU1_SPR_SPROT_RGN7_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENA_W*)0xF882E078u)

/** \brief  E07C, CPU Safety Protection Region SPR Write Access Enable Register
 * B */
#define CPU1_SPR_SPROT_RGN7_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_ACCENB_W*)0xF882E07Cu)

/** \brief  E070, CPU Safety Protection SPR Region Lower Address Register */
#define CPU1_SPR_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_LA*)0xF882E070u)

/** \brief  E074, CPU Safety protection SPR Region Upper Address Register */
#define CPU1_SPR_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGN_UA*)0xF882E074u)

/** \brief  E088, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU1_SPR_SPROT_RGNACCENA0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA0_R*)0xF882E088u)

/** \brief  E098, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU1_SPR_SPROT_RGNACCENA1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA1_R*)0xF882E098u)

/** \brief  E0A8, CPU Safety Protection Region SPR Read Access Enable Register A */
#define CPU1_SPR_SPROT_RGNACCENA2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_SPR_SPROT_RGNACCENA2_R*)0xF882E0A8u)

