Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1FF84, CPU Address General Purpose Register */
#define CPU2_A1 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF84u)

/** \brief  1FFA8, CPU Address General Purpose Register */
#define CPU2_A10 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFA8u)

/** \brief  1FFAC, CPU Address General Purpose Register */
#define CPU2_A11 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFACu)

/** \brief  1FFB0, CPU Address General Purpose Register */
#define CPU2_A12 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFB0u)

/** \brief  1FFB4, CPU Address General Purpose Register */
#define CPU2_A13 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFB4u)

/** \brief  1FFB8, CPU Address General Purpose Register */
#define CPU2_A14 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFB8u)

/** \brief  1FFBC, CPU Address General Purpose Register */
#define CPU2_A15 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFBCu)

/** \brief  1FF88, CPU Address General Purpose Register */
#define CPU2_A2 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF88u)

/** \brief  1FF8C, CPU Address General Purpose Register */
#define CPU2_A3 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF8Cu)

/** \brief  1FF90, CPU Address General Purpose Register */
#define CPU2_A4 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF90u)

/** \brief  1FF94, CPU Address General Purpose Register */
#define CPU2_A5 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF94u)

/** \brief  1FF98, CPU Address General Purpose Register */
#define CPU2_A6 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF98u)

/** \brief  1FF9C, CPU Address General Purpose Register */
#define CPU2_A7 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF9Cu)

/** \brief  1FFA0, CPU Address General Purpose Register */
#define CPU2_A8 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFA0u)

/** \brief  1FFA4, CPU Address General Purpose Register */
#define CPU2_A9 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFA4u)

/** \brief  1FE20, CPU Base Interrupt Vector Table Pointer */
#define CPU2_BIV /*lint --e(923)*/ (*(volatile Ifx_CPU_BIV*)0xF885FE20u)

/** \brief  1FE24, CPU Base Trap Vector Table Pointer */
#define CPU2_BTV /*lint --e(923)*/ (*(volatile Ifx_CPU_BTV*)0xF885FE24u)

/** \brief  1FC04, CPU CPU Clock Cycle Count */
#define CPU2_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF885FC04u)

/** \brief  1FC00, CPU Counter Control */
#define CPU2_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF885FC00u)

/** \brief  19400, CPU Compatibility Control Register */
#define CPU2_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8859400u)

/** \brief  1FE1C, CPU Core Identification Register */
#define CPU2_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF885FE1Cu)

/** \brief  1D000, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D000u)

/** \brief  1D004, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D004u)

/** \brief  1D008, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D008u)

/** \brief  1D00C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D00Cu)

/** \brief  1D010, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D010u)

/** \brief  1D014, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D014u)

/** \brief  1D018, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D018u)

/** \brief  1D01C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D01Cu)

/** \brief  1D020, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D020u)

/** \brief  1D024, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D024u)

/** \brief  1D028, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D028u)

/** \brief  1D02C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D02Cu)

/** \brief  1D030, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D030u)

/** \brief  1D034, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D034u)

/** \brief  1D038, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D038u)

/** \brief  1D03C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D03Cu)

/** \brief  1D040, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D040u)

/** \brief  1D044, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D044u)

/** \brief  1D048, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D048u)

/** \brief  1D04C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D04Cu)

/** \brief  1FE18, CPU Identification Register TC1.6P */
#define CPU2_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF885FE18u)

/** \brief  1E000, CPU Code Protection Execute Enable Register Set 0 */
#define CPU2_CPXE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_0*)0xF885E000u)

/** \brief  1E004, CPU Code Protection Execute Enable Register Set 1 */
#define CPU2_CPXE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_1*)0xF885E004u)

