Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E008, CPU Code Protection Execute Enable Register Set 2 */
#define CPU2_CPXE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_2*)0xF885E008u)

/** \brief  1E00C, CPU Code Protection Execute Enable Register Set 3 */
#define CPU2_CPXE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_3*)0xF885E00Cu)

/** \brief  1E050, CPU Code Protection Execute Enable Register Set 4 */
#define CPU2_CPXE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_4*)0xF885E050u)

/** \brief  1E054, CPU Code Protection Execute Enable Register Set 5 */
#define CPU2_CPXE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_5*)0xF885E054u)

/** \brief  1FD0C, CPU Core Register Access Event */
#define CPU2_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF885FD0Cu)

/** \brief  1FE50, CPU Customer ID register */
#define CPU2_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF885FE50u)

/** \brief  1FF00, CPU Data General Purpose Register */
#define CPU2_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF00u)

/** \brief  1FF04, CPU Data General Purpose Register */
#define CPU2_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF04u)

/** \brief  1FF28, CPU Data General Purpose Register */
#define CPU2_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF28u)

/** \brief  1FF2C, CPU Data General Purpose Register */
#define CPU2_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF2Cu)

/** \brief  1FF30, CPU Data General Purpose Register */
#define CPU2_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF30u)

/** \brief  1FF34, CPU Data General Purpose Register */
#define CPU2_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF34u)

/** \brief  1FF38, CPU Data General Purpose Register */
#define CPU2_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF38u)

/** \brief  1FF3C, CPU Data General Purpose Register */
#define CPU2_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF3Cu)

/** \brief  1FF08, CPU Data General Purpose Register */
#define CPU2_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF08u)

/** \brief  1FF0C, CPU Data General Purpose Register */
#define CPU2_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF0Cu)

/** \brief  1FF10, CPU Data General Purpose Register */
#define CPU2_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF10u)

/** \brief  1FF14, CPU Data General Purpose Register */
#define CPU2_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF14u)

/** \brief  1FF18, CPU Data General Purpose Register */
#define CPU2_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF18u)

/** \brief  1FF1C, CPU Data General Purpose Register */
#define CPU2_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF1Cu)

/** \brief  1FF20, CPU Data General Purpose Register */
#define CPU2_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF20u)

/** \brief  1FF24, CPU Data General Purpose Register */
#define CPU2_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF24u)

/** \brief  19018, CPU Data Asynchronous Trap Register */
#define CPU2_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8859018u)

/** \brief  1FD00, CPU Debug Status Register */
#define CPU2_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF885FD00u)

/** \brief  1FD48, CPU Debug Trap Control Register */
#define CPU2_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF885FD48u)

/** \brief  19040, CPU Data Memory Control Register */
#define CPU2_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8859040u)

/** \brief  19000, CPU Data Control Register 2 */
#define CPU2_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8859000u)

/** \brief  1FD44, CPU Debug Context Save Area Pointer */
#define CPU2_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF885FD44u)

/** \brief  1901C, CPU Data Error Address Register */
#define CPU2_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF885901Cu)

/** \brief  19020, CPU Data Integrity Error Address Register */
#define CPU2_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8859020u)

/** \brief  19024, CPU Data Integrity Error Trap Register */
#define CPU2_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8859024u)

/** \brief  E208, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU2_DLMU_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF884E208u)

/** \brief  E20C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF884E20Cu)

/** \brief  E200, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU2_DLMU_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF884E200u)

/** \brief  E204, CPU Safety protection DLMU Region Upper Address Register */
#define CPU2_DLMU_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF884E204u)

/** \brief  E218, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU2_DLMU_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF884E218u)

/** \brief  E21C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF884E21Cu)

/** \brief  E210, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU2_DLMU_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF884E210u)

/** \brief  E214, CPU Safety protection DLMU Region Upper Address Register */
#define CPU2_DLMU_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF884E214u)

/** \brief  E228, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU2_DLMU_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF884E228u)

/** \brief  E22C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF884E22Cu)

/** \brief  E220, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU2_DLMU_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF884E220u)

/** \brief  E224, CPU Safety protection DLMU Region Upper Address Register */
#define CPU2_DLMU_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF884E224u)

