Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E2CC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGNACCENB4_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB4_R*)0xF884E2CCu)

/** \brief  E2DC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGNACCENB5_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB5_R*)0xF884E2DCu)

/** \brief  E2EC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGNACCENB6_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB6_R*)0xF884E2ECu)

/** \brief  E2FC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU2_DLMU_SPROT_RGNACCENB7_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB7_R*)0xF884E2FCu)

/** \brief  1FD40, CPU Debug Monitor Start Address */
#define CPU2_DMS /*lint --e(923)*/ (*(volatile Ifx_CPU_DMS*)0xF885FD40u)

/** \brief  1C000, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C000u)

/** \brief  1C004, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C004u)

/** \brief  1C050, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR10_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C050u)

/** \brief  1C054, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR10_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C054u)

/** \brief  1C058, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR11_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C058u)

/** \brief  1C05C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR11_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C05Cu)

/** \brief  1C060, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR12_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C060u)

/** \brief  1C064, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR12_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C064u)

/** \brief  1C068, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR13_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C068u)

/** \brief  1C06C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR13_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C06Cu)

/** \brief  1C070, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR14_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C070u)

/** \brief  1C074, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR14_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C074u)

/** \brief  1C078, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR15_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C078u)

/** \brief  1C07C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR15_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C07Cu)

/** \brief  1C080, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR16_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C080u)

/** \brief  1C084, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR16_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C084u)

/** \brief  1C088, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR17_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C088u)

/** \brief  1C08C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR17_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C08Cu)

/** \brief  1C008, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C008u)

/** \brief  1C00C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C00Cu)

/** \brief  1C010, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C010u)

/** \brief  1C014, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C014u)

/** \brief  1C018, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C018u)

/** \brief  1C01C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C01Cu)

/** \brief  1C020, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C020u)

/** \brief  1C024, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C024u)

/** \brief  1C028, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C028u)

/** \brief  1C02C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C02Cu)

/** \brief  1C030, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C030u)

/** \brief  1C034, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C034u)

/** \brief  1C038, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C038u)

/** \brief  1C03C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C03Cu)

/** \brief  1C040, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C040u)

/** \brief  1C044, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C044u)

/** \brief  1C048, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C048u)

/** \brief  1C04C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C04Cu)

/** \brief  1E010, CPU Data Protection Read Enable Register Set 0 */
#define CPU2_DPRE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_0*)0xF885E010u)

/** \brief  1E014, CPU Data Protection Read Enable Register Set 1 */
#define CPU2_DPRE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_1*)0xF885E014u)

/** \brief  1E018, CPU Data Protection Read Enable Register Set 2 */
#define CPU2_DPRE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_2*)0xF885E018u)

