Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E4, CPU Overlay Mask Register 17 */
#define CPU2_OMASK17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK17*)0xF88400E4u)

/** \brief  F0, CPU Overlay Mask Register 18 */
#define CPU2_OMASK18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK18*)0xF88400F0u)

/** \brief  FC, CPU Overlay Mask Register 19 */
#define CPU2_OMASK19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK19*)0xF88400FCu)

/** \brief  30, CPU Overlay Mask Register 2 */
#define CPU2_OMASK2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK2*)0xF8840030u)

/** \brief  108, CPU Overlay Mask Register 20 */
#define CPU2_OMASK20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK20*)0xF8840108u)

/** \brief  114, CPU Overlay Mask Register 21 */
#define CPU2_OMASK21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK21*)0xF8840114u)

/** \brief  120, CPU Overlay Mask Register 22 */
#define CPU2_OMASK22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK22*)0xF8840120u)

/** \brief  12C, CPU Overlay Mask Register 23 */
#define CPU2_OMASK23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK23*)0xF884012Cu)

/** \brief  138, CPU Overlay Mask Register 24 */
#define CPU2_OMASK24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK24*)0xF8840138u)

/** \brief  144, CPU Overlay Mask Register 25 */
#define CPU2_OMASK25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK25*)0xF8840144u)

/** \brief  150, CPU Overlay Mask Register 26 */
#define CPU2_OMASK26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK26*)0xF8840150u)

/** \brief  15C, CPU Overlay Mask Register 27 */
#define CPU2_OMASK27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK27*)0xF884015Cu)

/** \brief  168, CPU Overlay Mask Register 28 */
#define CPU2_OMASK28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK28*)0xF8840168u)

/** \brief  174, CPU Overlay Mask Register 29 */
#define CPU2_OMASK29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK29*)0xF8840174u)

/** \brief  3C, CPU Overlay Mask Register 3 */
#define CPU2_OMASK3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK3*)0xF884003Cu)

/** \brief  180, CPU Overlay Mask Register 30 */
#define CPU2_OMASK30 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK30*)0xF8840180u)

/** \brief  18C, CPU Overlay Mask Register 31 */
#define CPU2_OMASK31 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK31*)0xF884018Cu)

/** \brief  48, CPU Overlay Mask Register 4 */
#define CPU2_OMASK4 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK4*)0xF8840048u)

/** \brief  54, CPU Overlay Mask Register 5 */
#define CPU2_OMASK5 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK5*)0xF8840054u)

/** \brief  60, CPU Overlay Mask Register 6 */
#define CPU2_OMASK6 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK6*)0xF8840060u)

/** \brief  6C, CPU Overlay Mask Register 7 */
#define CPU2_OMASK7 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK7*)0xF884006Cu)

/** \brief  78, CPU Overlay Mask Register 8 */
#define CPU2_OMASK8 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK8*)0xF8840078u)

/** \brief  84, CPU Overlay Mask Register 9 */
#define CPU2_OMASK9 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK9*)0xF8840084u)

/** \brief  0, CPU Overlay Range Select Register */
#define CPU2_OSEL /*lint --e(923)*/ (*(volatile Ifx_CPU_OSEL*)0xF8840000u)

/** \brief  14, CPU Overlay Target Address Register 0 */
#define CPU2_OTAR0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR0*)0xF8840014u)

/** \brief  20, CPU Overlay Target Address Register 1 */
#define CPU2_OTAR1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR1*)0xF8840020u)

/** \brief  8C, CPU Overlay Target Address Register 10 */
#define CPU2_OTAR10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR10*)0xF884008Cu)

/** \brief  98, CPU Overlay Target Address Register 11 */
#define CPU2_OTAR11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR11*)0xF8840098u)

/** \brief  A4, CPU Overlay Target Address Register 12 */
#define CPU2_OTAR12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR12*)0xF88400A4u)

/** \brief  B0, CPU Overlay Target Address Register 13 */
#define CPU2_OTAR13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR13*)0xF88400B0u)

/** \brief  BC, CPU Overlay Target Address Register 14 */
#define CPU2_OTAR14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR14*)0xF88400BCu)

/** \brief  C8, CPU Overlay Target Address Register 15 */
#define CPU2_OTAR15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR15*)0xF88400C8u)

/** \brief  D4, CPU Overlay Target Address Register 16 */
#define CPU2_OTAR16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR16*)0xF88400D4u)

/** \brief  E0, CPU Overlay Target Address Register 17 */
#define CPU2_OTAR17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR17*)0xF88400E0u)

/** \brief  EC, CPU Overlay Target Address Register 18 */
#define CPU2_OTAR18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR18*)0xF88400ECu)

/** \brief  F8, CPU Overlay Target Address Register 19 */
#define CPU2_OTAR19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR19*)0xF88400F8u)

/** \brief  2C, CPU Overlay Target Address Register 2 */
#define CPU2_OTAR2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR2*)0xF884002Cu)

/** \brief  104, CPU Overlay Target Address Register 20 */
#define CPU2_OTAR20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR20*)0xF8840104u)

/** \brief  110, CPU Overlay Target Address Register 21 */
#define CPU2_OTAR21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR21*)0xF8840110u)

/** \brief  11C, CPU Overlay Target Address Register 22 */
#define CPU2_OTAR22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR22*)0xF884011Cu)

/** \brief  128, CPU Overlay Target Address Register 23 */
#define CPU2_OTAR23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR23*)0xF8840128u)

/** \brief  134, CPU Overlay Target Address Register 24 */
#define CPU2_OTAR24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR24*)0xF8840134u)

/** \brief  140, CPU Overlay Target Address Register 25 */
#define CPU2_OTAR25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR25*)0xF8840140u)

/** \brief  14C, CPU Overlay Target Address Register 26 */
#define CPU2_OTAR26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR26*)0xF884014Cu)

/** \brief  158, CPU Overlay Target Address Register 27 */
#define CPU2_OTAR27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR27*)0xF8840158u)

/** \brief  164, CPU Overlay Target Address Register 28 */
#define CPU2_OTAR28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR28*)0xF8840164u)

/** \brief  170, CPU Overlay Target Address Register 29 */
#define CPU2_OTAR29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR29*)0xF8840170u)

/** \brief  38, CPU Overlay Target Address Register 3 */
#define CPU2_OTAR3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR3*)0xF8840038u)

