Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1FF84, CPU Address General Purpose Register */
#define CPU3_A1 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF84u)

/** \brief  1FFA8, CPU Address General Purpose Register */
#define CPU3_A10 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFA8u)

/** \brief  1FFAC, CPU Address General Purpose Register */
#define CPU3_A11 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFACu)

/** \brief  1FFB0, CPU Address General Purpose Register */
#define CPU3_A12 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFB0u)

/** \brief  1FFB4, CPU Address General Purpose Register */
#define CPU3_A13 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFB4u)

/** \brief  1FFB8, CPU Address General Purpose Register */
#define CPU3_A14 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFB8u)

/** \brief  1FFBC, CPU Address General Purpose Register */
#define CPU3_A15 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFBCu)

/** \brief  1FF88, CPU Address General Purpose Register */
#define CPU3_A2 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF88u)

/** \brief  1FF8C, CPU Address General Purpose Register */
#define CPU3_A3 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF8Cu)

/** \brief  1FF90, CPU Address General Purpose Register */
#define CPU3_A4 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF90u)

/** \brief  1FF94, CPU Address General Purpose Register */
#define CPU3_A5 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF94u)

/** \brief  1FF98, CPU Address General Purpose Register */
#define CPU3_A6 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF98u)

/** \brief  1FF9C, CPU Address General Purpose Register */
#define CPU3_A7 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FF9Cu)

/** \brief  1FFA0, CPU Address General Purpose Register */
#define CPU3_A8 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFA0u)

/** \brief  1FFA4, CPU Address General Purpose Register */
#define CPU3_A9 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF887FFA4u)

/** \brief  1FE20, CPU Base Interrupt Vector Table Pointer */
#define CPU3_BIV /*lint --e(923)*/ (*(volatile Ifx_CPU_BIV*)0xF887FE20u)

/** \brief  1FE24, CPU Base Trap Vector Table Pointer */
#define CPU3_BTV /*lint --e(923)*/ (*(volatile Ifx_CPU_BTV*)0xF887FE24u)

/** \brief  1FC04, CPU CPU Clock Cycle Count */
#define CPU3_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF887FC04u)

/** \brief  1FC00, CPU Counter Control */
#define CPU3_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF887FC00u)

/** \brief  19400, CPU Compatibility Control Register */
#define CPU3_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8879400u)

/** \brief  1FE1C, CPU Core Identification Register */
#define CPU3_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF887FE1Cu)

/** \brief  1D000, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D000u)

/** \brief  1D004, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D004u)

/** \brief  1D008, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D008u)

/** \brief  1D00C, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D00Cu)

/** \brief  1D010, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D010u)

/** \brief  1D014, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D014u)

/** \brief  1D018, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D018u)

/** \brief  1D01C, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D01Cu)

/** \brief  1D020, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D020u)

/** \brief  1D024, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D024u)

/** \brief  1D028, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D028u)

/** \brief  1D02C, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D02Cu)

/** \brief  1D030, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D030u)

/** \brief  1D034, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D034u)

/** \brief  1D038, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D038u)

/** \brief  1D03C, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D03Cu)

/** \brief  1D040, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D040u)

/** \brief  1D044, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D044u)

/** \brief  1D048, CPU Code Protection Range Lower Bound Register */
#define CPU3_CPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF887D048u)

/** \brief  1D04C, CPU Code Protection Range Upper Bound Register */
#define CPU3_CPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF887D04Cu)

/** \brief  1FE18, CPU Identification Register TC1.6P */
#define CPU3_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF887FE18u)

/** \brief  1E000, CPU Code Protection Execute Enable Register Set 0 */
#define CPU3_CPXE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_0*)0xF887E000u)

/** \brief  1E004, CPU Code Protection Execute Enable Register Set 1 */
#define CPU3_CPXE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_1*)0xF887E004u)

