Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E008, CPU Code Protection Execute Enable Register Set 2 */
#define CPU3_CPXE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_2*)0xF887E008u)

/** \brief  1E00C, CPU Code Protection Execute Enable Register Set 3 */
#define CPU3_CPXE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_3*)0xF887E00Cu)

/** \brief  1E050, CPU Code Protection Execute Enable Register Set 4 */
#define CPU3_CPXE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_4*)0xF887E050u)

/** \brief  1E054, CPU Code Protection Execute Enable Register Set 5 */
#define CPU3_CPXE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_5*)0xF887E054u)

/** \brief  1FD0C, CPU Core Register Access Event */
#define CPU3_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF887FD0Cu)

/** \brief  1FE50, CPU Customer ID register */
#define CPU3_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF887FE50u)

/** \brief  1FF00, CPU Data General Purpose Register */
#define CPU3_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF00u)

/** \brief  1FF04, CPU Data General Purpose Register */
#define CPU3_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF04u)

/** \brief  1FF28, CPU Data General Purpose Register */
#define CPU3_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF28u)

/** \brief  1FF2C, CPU Data General Purpose Register */
#define CPU3_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF2Cu)

/** \brief  1FF30, CPU Data General Purpose Register */
#define CPU3_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF30u)

/** \brief  1FF34, CPU Data General Purpose Register */
#define CPU3_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF34u)

/** \brief  1FF38, CPU Data General Purpose Register */
#define CPU3_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF38u)

/** \brief  1FF3C, CPU Data General Purpose Register */
#define CPU3_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF3Cu)

/** \brief  1FF08, CPU Data General Purpose Register */
#define CPU3_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF08u)

/** \brief  1FF0C, CPU Data General Purpose Register */
#define CPU3_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF0Cu)

/** \brief  1FF10, CPU Data General Purpose Register */
#define CPU3_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF10u)

/** \brief  1FF14, CPU Data General Purpose Register */
#define CPU3_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF14u)

/** \brief  1FF18, CPU Data General Purpose Register */
#define CPU3_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF18u)

/** \brief  1FF1C, CPU Data General Purpose Register */
#define CPU3_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF1Cu)

/** \brief  1FF20, CPU Data General Purpose Register */
#define CPU3_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF20u)

/** \brief  1FF24, CPU Data General Purpose Register */
#define CPU3_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF887FF24u)

/** \brief  19018, CPU Data Asynchronous Trap Register */
#define CPU3_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8879018u)

/** \brief  1FD00, CPU Debug Status Register */
#define CPU3_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF887FD00u)

/** \brief  1FD48, CPU Debug Trap Control Register */
#define CPU3_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF887FD48u)

/** \brief  19040, CPU Data Memory Control Register */
#define CPU3_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8879040u)

/** \brief  19000, CPU Data Control Register 2 */
#define CPU3_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8879000u)

/** \brief  1FD44, CPU Debug Context Save Area Pointer */
#define CPU3_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF887FD44u)

/** \brief  1901C, CPU Data Error Address Register */
#define CPU3_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF887901Cu)

/** \brief  19020, CPU Data Integrity Error Address Register */
#define CPU3_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8879020u)

/** \brief  19024, CPU Data Integrity Error Trap Register */
#define CPU3_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8879024u)

/** \brief  E208, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU3_DLMU_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF886E208u)

/** \brief  E20C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU3_DLMU_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF886E20Cu)

/** \brief  E200, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU3_DLMU_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF886E200u)

/** \brief  E204, CPU Safety protection DLMU Region Upper Address Register */
#define CPU3_DLMU_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF886E204u)

/** \brief  E218, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU3_DLMU_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF886E218u)

/** \brief  E21C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU3_DLMU_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF886E21Cu)

/** \brief  E210, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU3_DLMU_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF886E210u)

/** \brief  E214, CPU Safety protection DLMU Region Upper Address Register */
#define CPU3_DLMU_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF886E214u)

/** \brief  E228, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU3_DLMU_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF886E228u)

/** \brief  E22C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU3_DLMU_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF886E22Cu)

/** \brief  E220, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU3_DLMU_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF886E220u)

/** \brief  E224, CPU Safety protection DLMU Region Upper Address Register */
#define CPU3_DLMU_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF886E224u)

