Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E01C, CPU Data Protection Read Enable Register Set 3 */
#define CPU3_DPRE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_3*)0xF887E01Cu)

/** \brief  1E060, CPU Data Protection Read Enable Register Set 4 */
#define CPU3_DPRE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_4*)0xF887E060u)

/** \brief  1E064, CPU Data Protection Read Enable Register Set 5 */
#define CPU3_DPRE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_5*)0xF887E064u)

/** \brief  1E020, CPU Data Protection Write Enable Register Set 0 */
#define CPU3_DPWE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_0*)0xF887E020u)

/** \brief  1E024, CPU Data Protection Write Enable Register Set 1 */
#define CPU3_DPWE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_1*)0xF887E024u)

/** \brief  1E028, CPU Data Protection Write Enable Register Set 2 */
#define CPU3_DPWE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_2*)0xF887E028u)

/** \brief  1E02C, CPU Data Protection Write Enable Register Set 3 */
#define CPU3_DPWE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_3*)0xF887E02Cu)

/** \brief  1E070, CPU Data Protection Write Enable Register Set 4 */
#define CPU3_DPWE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_4*)0xF887E070u)

/** \brief  1E074, CPU Data Protection Write Enable Register Set 5 */
#define CPU3_DPWE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_5*)0xF887E074u)

/** \brief  19010, CPU Data Synchronous Trap Register */
#define CPU3_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF8879010u)

/** \brief  1FD08, CPU External Event Register */
#define CPU3_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF887FD08u)

/** \brief  1FE38, CPU Free CSA List Head Pointer */
#define CPU3_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF887FE38u)

/** \brief  1100, CPU Flash Configuration Register 0 */
#define CPU3_FLASHCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF8861100u)

/** \brief  1104, CPU Flash Configuration Register 1 */
#define CPU3_FLASHCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF8861104u)

/** \brief  1108, CPU Flash Configuration Register 2 */
#define CPU3_FLASHCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF8861108u)

/** \brief  110C, CPU Flash Configuration Register 3 */
#define CPU3_FLASHCON3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF886110Cu)

/** \brief  1A000, CPU Trap Control Register */
#define CPU3_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF887A000u)

/** \brief  1A008, CPU Trapping Instruction Opcode Register */
#define CPU3_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF887A008u)

/** \brief  1A004, CPU Trapping Instruction Program Counter Register */
#define CPU3_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF887A004u)

/** \brief  1A010, CPU Trapping Instruction Operand Register */
#define CPU3_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF887A010u)

/** \brief  1A014, CPU Trapping Instruction Operand Register */
#define CPU3_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF887A014u)

/** \brief  1A018, CPU Trapping Instruction Operand Register */
#define CPU3_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF887A018u)

/** \brief  1FC08, CPU Instruction Count */
#define CPU3_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF887FC08u)

/** \brief  1FE2C, CPU Interrupt Control Register */
#define CPU3_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF887FE2Cu)

/** \brief  1FE28, CPU Interrupt Stack Pointer */
#define CPU3_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF887FE28u)

/** \brief  D000, CPU Reset Register 0 */
#define CPU3_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST0*)0xF886D000u)

/** \brief  D004, CPU Reset Register 1 */
#define CPU3_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST1*)0xF886D004u)

/** \brief  D008, CPU Reset Status Clear Register */
#define CPU3_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF886D008u)

/** \brief  1FE3C, CPU Free CSA List Limit Pointer */
#define CPU3_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF887FE3Cu)

/** \brief  E110, CPU Safety Protection Region LPB Read Access Enable Register A */
#define CPU3_LPB_SPROT_ACCENA_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF886E110u)

/** \brief  E114, CPU Safety Protection Region LPB Read Access Enable Register B */
#define CPU3_LPB_SPROT_ACCENB_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF886E114u)

/** \brief  1FC0C, CPU Multi-Count Register 1 */
#define CPU3_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF887FC0Cu)

/** \brief  1FC10, CPU Multi-Count Register 2 */
#define CPU3_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF887FC10u)

/** \brief  1FC14, CPU Multi-Count Register 3 */
#define CPU3_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF887FC14u)

/** \brief  18, CPU Overlay Mask Register 0 */
#define CPU3_OMASK0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK0*)0xF8860018u)

/** \brief  24, CPU Overlay Mask Register 1 */
#define CPU3_OMASK1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK1*)0xF8860024u)

/** \brief  90, CPU Overlay Mask Register 10 */
#define CPU3_OMASK10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK10*)0xF8860090u)

/** \brief  9C, CPU Overlay Mask Register 11 */
#define CPU3_OMASK11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK11*)0xF886009Cu)

/** \brief  A8, CPU Overlay Mask Register 12 */
#define CPU3_OMASK12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK12*)0xF88600A8u)

/** \brief  B4, CPU Overlay Mask Register 13 */
#define CPU3_OMASK13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK13*)0xF88600B4u)

/** \brief  C0, CPU Overlay Mask Register 14 */
#define CPU3_OMASK14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK14*)0xF88600C0u)

/** \brief  CC, CPU Overlay Mask Register 15 */
#define CPU3_OMASK15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK15*)0xF88600CCu)

/** \brief  D8, CPU Overlay Mask Register 16 */
#define CPU3_OMASK16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK16*)0xF88600D8u)

