Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E4, CPU Overlay Mask Register 17 */
#define CPU3_OMASK17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK17*)0xF88600E4u)

/** \brief  F0, CPU Overlay Mask Register 18 */
#define CPU3_OMASK18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK18*)0xF88600F0u)

/** \brief  FC, CPU Overlay Mask Register 19 */
#define CPU3_OMASK19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK19*)0xF88600FCu)

/** \brief  30, CPU Overlay Mask Register 2 */
#define CPU3_OMASK2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK2*)0xF8860030u)

/** \brief  108, CPU Overlay Mask Register 20 */
#define CPU3_OMASK20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK20*)0xF8860108u)

/** \brief  114, CPU Overlay Mask Register 21 */
#define CPU3_OMASK21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK21*)0xF8860114u)

/** \brief  120, CPU Overlay Mask Register 22 */
#define CPU3_OMASK22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK22*)0xF8860120u)

/** \brief  12C, CPU Overlay Mask Register 23 */
#define CPU3_OMASK23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK23*)0xF886012Cu)

/** \brief  138, CPU Overlay Mask Register 24 */
#define CPU3_OMASK24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK24*)0xF8860138u)

/** \brief  144, CPU Overlay Mask Register 25 */
#define CPU3_OMASK25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK25*)0xF8860144u)

/** \brief  150, CPU Overlay Mask Register 26 */
#define CPU3_OMASK26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK26*)0xF8860150u)

/** \brief  15C, CPU Overlay Mask Register 27 */
#define CPU3_OMASK27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK27*)0xF886015Cu)

/** \brief  168, CPU Overlay Mask Register 28 */
#define CPU3_OMASK28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK28*)0xF8860168u)

/** \brief  174, CPU Overlay Mask Register 29 */
#define CPU3_OMASK29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK29*)0xF8860174u)

/** \brief  3C, CPU Overlay Mask Register 3 */
#define CPU3_OMASK3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK3*)0xF886003Cu)

/** \brief  180, CPU Overlay Mask Register 30 */
#define CPU3_OMASK30 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK30*)0xF8860180u)

/** \brief  18C, CPU Overlay Mask Register 31 */
#define CPU3_OMASK31 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK31*)0xF886018Cu)

/** \brief  48, CPU Overlay Mask Register 4 */
#define CPU3_OMASK4 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK4*)0xF8860048u)

/** \brief  54, CPU Overlay Mask Register 5 */
#define CPU3_OMASK5 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK5*)0xF8860054u)

/** \brief  60, CPU Overlay Mask Register 6 */
#define CPU3_OMASK6 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK6*)0xF8860060u)

/** \brief  6C, CPU Overlay Mask Register 7 */
#define CPU3_OMASK7 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK7*)0xF886006Cu)

/** \brief  78, CPU Overlay Mask Register 8 */
#define CPU3_OMASK8 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK8*)0xF8860078u)

/** \brief  84, CPU Overlay Mask Register 9 */
#define CPU3_OMASK9 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK9*)0xF8860084u)

/** \brief  0, CPU Overlay Range Select Register */
#define CPU3_OSEL /*lint --e(923)*/ (*(volatile Ifx_CPU_OSEL*)0xF8860000u)

/** \brief  14, CPU Overlay Target Address Register 0 */
#define CPU3_OTAR0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR0*)0xF8860014u)

/** \brief  20, CPU Overlay Target Address Register 1 */
#define CPU3_OTAR1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR1*)0xF8860020u)

/** \brief  8C, CPU Overlay Target Address Register 10 */
#define CPU3_OTAR10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR10*)0xF886008Cu)

/** \brief  98, CPU Overlay Target Address Register 11 */
#define CPU3_OTAR11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR11*)0xF8860098u)

/** \brief  A4, CPU Overlay Target Address Register 12 */
#define CPU3_OTAR12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR12*)0xF88600A4u)

/** \brief  B0, CPU Overlay Target Address Register 13 */
#define CPU3_OTAR13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR13*)0xF88600B0u)

/** \brief  BC, CPU Overlay Target Address Register 14 */
#define CPU3_OTAR14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR14*)0xF88600BCu)

/** \brief  C8, CPU Overlay Target Address Register 15 */
#define CPU3_OTAR15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR15*)0xF88600C8u)

/** \brief  D4, CPU Overlay Target Address Register 16 */
#define CPU3_OTAR16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR16*)0xF88600D4u)

/** \brief  E0, CPU Overlay Target Address Register 17 */
#define CPU3_OTAR17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR17*)0xF88600E0u)

/** \brief  EC, CPU Overlay Target Address Register 18 */
#define CPU3_OTAR18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR18*)0xF88600ECu)

/** \brief  F8, CPU Overlay Target Address Register 19 */
#define CPU3_OTAR19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR19*)0xF88600F8u)

/** \brief  2C, CPU Overlay Target Address Register 2 */
#define CPU3_OTAR2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR2*)0xF886002Cu)

/** \brief  104, CPU Overlay Target Address Register 20 */
#define CPU3_OTAR20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR20*)0xF8860104u)

/** \brief  110, CPU Overlay Target Address Register 21 */
#define CPU3_OTAR21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR21*)0xF8860110u)

/** \brief  11C, CPU Overlay Target Address Register 22 */
#define CPU3_OTAR22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR22*)0xF886011Cu)

/** \brief  128, CPU Overlay Target Address Register 23 */
#define CPU3_OTAR23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR23*)0xF8860128u)

/** \brief  134, CPU Overlay Target Address Register 24 */
#define CPU3_OTAR24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR24*)0xF8860134u)

/** \brief  140, CPU Overlay Target Address Register 25 */
#define CPU3_OTAR25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR25*)0xF8860140u)

/** \brief  14C, CPU Overlay Target Address Register 26 */
#define CPU3_OTAR26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR26*)0xF886014Cu)

/** \brief  158, CPU Overlay Target Address Register 27 */
#define CPU3_OTAR27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR27*)0xF8860158u)

/** \brief  164, CPU Overlay Target Address Register 28 */
#define CPU3_OTAR28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR28*)0xF8860164u)

/** \brief  170, CPU Overlay Target Address Register 29 */
#define CPU3_OTAR29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR29*)0xF8860170u)

/** \brief  38, CPU Overlay Target Address Register 3 */
#define CPU3_OTAR3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR3*)0xF8860038u)

