Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1FF84, CPU Address General Purpose Register */
#define CPU4_A1 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF84u)

/** \brief  1FFA8, CPU Address General Purpose Register */
#define CPU4_A10 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFA8u)

/** \brief  1FFAC, CPU Address General Purpose Register */
#define CPU4_A11 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFACu)

/** \brief  1FFB0, CPU Address General Purpose Register */
#define CPU4_A12 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFB0u)

/** \brief  1FFB4, CPU Address General Purpose Register */
#define CPU4_A13 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFB4u)

/** \brief  1FFB8, CPU Address General Purpose Register */
#define CPU4_A14 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFB8u)

/** \brief  1FFBC, CPU Address General Purpose Register */
#define CPU4_A15 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFBCu)

/** \brief  1FF88, CPU Address General Purpose Register */
#define CPU4_A2 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF88u)

/** \brief  1FF8C, CPU Address General Purpose Register */
#define CPU4_A3 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF8Cu)

/** \brief  1FF90, CPU Address General Purpose Register */
#define CPU4_A4 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF90u)

/** \brief  1FF94, CPU Address General Purpose Register */
#define CPU4_A5 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF94u)

/** \brief  1FF98, CPU Address General Purpose Register */
#define CPU4_A6 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF98u)

/** \brief  1FF9C, CPU Address General Purpose Register */
#define CPU4_A7 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FF9Cu)

/** \brief  1FFA0, CPU Address General Purpose Register */
#define CPU4_A8 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFA0u)

/** \brief  1FFA4, CPU Address General Purpose Register */
#define CPU4_A9 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF889FFA4u)

/** \brief  1FE20, CPU Base Interrupt Vector Table Pointer */
#define CPU4_BIV /*lint --e(923)*/ (*(volatile Ifx_CPU_BIV*)0xF889FE20u)

/** \brief  1FE24, CPU Base Trap Vector Table Pointer */
#define CPU4_BTV /*lint --e(923)*/ (*(volatile Ifx_CPU_BTV*)0xF889FE24u)

/** \brief  1FC04, CPU CPU Clock Cycle Count */
#define CPU4_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF889FC04u)

/** \brief  1FC00, CPU Counter Control */
#define CPU4_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF889FC00u)

/** \brief  19400, CPU Compatibility Control Register */
#define CPU4_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8899400u)

/** \brief  1FE1C, CPU Core Identification Register */
#define CPU4_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF889FE1Cu)

/** \brief  1D000, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D000u)

/** \brief  1D004, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D004u)

/** \brief  1D008, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D008u)

/** \brief  1D00C, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D00Cu)

/** \brief  1D010, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D010u)

/** \brief  1D014, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D014u)

/** \brief  1D018, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D018u)

/** \brief  1D01C, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D01Cu)

/** \brief  1D020, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D020u)

/** \brief  1D024, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D024u)

/** \brief  1D028, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D028u)

/** \brief  1D02C, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D02Cu)

/** \brief  1D030, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D030u)

/** \brief  1D034, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D034u)

/** \brief  1D038, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D038u)

/** \brief  1D03C, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D03Cu)

/** \brief  1D040, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D040u)

/** \brief  1D044, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D044u)

/** \brief  1D048, CPU Code Protection Range Lower Bound Register */
#define CPU4_CPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF889D048u)

/** \brief  1D04C, CPU Code Protection Range Upper Bound Register */
#define CPU4_CPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF889D04Cu)

/** \brief  1FE18, CPU Identification Register TC1.6P */
#define CPU4_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF889FE18u)

/** \brief  1E000, CPU Code Protection Execute Enable Register Set 0 */
#define CPU4_CPXE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_0*)0xF889E000u)

/** \brief  1E004, CPU Code Protection Execute Enable Register Set 1 */
#define CPU4_CPXE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_1*)0xF889E004u)

