Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E008, CPU Code Protection Execute Enable Register Set 2 */
#define CPU4_CPXE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_2*)0xF889E008u)

/** \brief  1E00C, CPU Code Protection Execute Enable Register Set 3 */
#define CPU4_CPXE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_3*)0xF889E00Cu)

/** \brief  1E050, CPU Code Protection Execute Enable Register Set 4 */
#define CPU4_CPXE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_4*)0xF889E050u)

/** \brief  1E054, CPU Code Protection Execute Enable Register Set 5 */
#define CPU4_CPXE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_5*)0xF889E054u)

/** \brief  1FD0C, CPU Core Register Access Event */
#define CPU4_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF889FD0Cu)

/** \brief  1FE50, CPU Customer ID register */
#define CPU4_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF889FE50u)

/** \brief  1FF00, CPU Data General Purpose Register */
#define CPU4_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF00u)

/** \brief  1FF04, CPU Data General Purpose Register */
#define CPU4_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF04u)

/** \brief  1FF28, CPU Data General Purpose Register */
#define CPU4_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF28u)

/** \brief  1FF2C, CPU Data General Purpose Register */
#define CPU4_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF2Cu)

/** \brief  1FF30, CPU Data General Purpose Register */
#define CPU4_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF30u)

/** \brief  1FF34, CPU Data General Purpose Register */
#define CPU4_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF34u)

/** \brief  1FF38, CPU Data General Purpose Register */
#define CPU4_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF38u)

/** \brief  1FF3C, CPU Data General Purpose Register */
#define CPU4_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF3Cu)

/** \brief  1FF08, CPU Data General Purpose Register */
#define CPU4_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF08u)

/** \brief  1FF0C, CPU Data General Purpose Register */
#define CPU4_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF0Cu)

/** \brief  1FF10, CPU Data General Purpose Register */
#define CPU4_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF10u)

/** \brief  1FF14, CPU Data General Purpose Register */
#define CPU4_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF14u)

/** \brief  1FF18, CPU Data General Purpose Register */
#define CPU4_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF18u)

/** \brief  1FF1C, CPU Data General Purpose Register */
#define CPU4_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF1Cu)

/** \brief  1FF20, CPU Data General Purpose Register */
#define CPU4_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF20u)

/** \brief  1FF24, CPU Data General Purpose Register */
#define CPU4_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF889FF24u)

/** \brief  19018, CPU Data Asynchronous Trap Register */
#define CPU4_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8899018u)

/** \brief  1FD00, CPU Debug Status Register */
#define CPU4_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF889FD00u)

/** \brief  1FD48, CPU Debug Trap Control Register */
#define CPU4_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF889FD48u)

/** \brief  19040, CPU Data Memory Control Register */
#define CPU4_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8899040u)

/** \brief  19000, CPU Data Control Register 2 */
#define CPU4_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8899000u)

/** \brief  1FD44, CPU Debug Context Save Area Pointer */
#define CPU4_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF889FD44u)

/** \brief  1901C, CPU Data Error Address Register */
#define CPU4_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF889901Cu)

/** \brief  19020, CPU Data Integrity Error Address Register */
#define CPU4_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8899020u)

/** \brief  19024, CPU Data Integrity Error Trap Register */
#define CPU4_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8899024u)

/** \brief  E208, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU4_DLMU_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF888E208u)

/** \brief  E20C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU4_DLMU_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF888E20Cu)

/** \brief  E200, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU4_DLMU_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF888E200u)

/** \brief  E204, CPU Safety protection DLMU Region Upper Address Register */
#define CPU4_DLMU_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF888E204u)

/** \brief  E218, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU4_DLMU_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF888E218u)

/** \brief  E21C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU4_DLMU_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF888E21Cu)

/** \brief  E210, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU4_DLMU_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF888E210u)

/** \brief  E214, CPU Safety protection DLMU Region Upper Address Register */
#define CPU4_DLMU_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF888E214u)

/** \brief  E228, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU4_DLMU_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF888E228u)

/** \brief  E22C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU4_DLMU_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF888E22Cu)

/** \brief  E220, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU4_DLMU_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF888E220u)

/** \brief  E224, CPU Safety protection DLMU Region Upper Address Register */
#define CPU4_DLMU_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF888E224u)

