Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E01C, CPU Data Protection Read Enable Register Set 3 */
#define CPU4_DPRE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_3*)0xF889E01Cu)

/** \brief  1E060, CPU Data Protection Read Enable Register Set 4 */
#define CPU4_DPRE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_4*)0xF889E060u)

/** \brief  1E064, CPU Data Protection Read Enable Register Set 5 */
#define CPU4_DPRE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_5*)0xF889E064u)

/** \brief  1E020, CPU Data Protection Write Enable Register Set 0 */
#define CPU4_DPWE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_0*)0xF889E020u)

/** \brief  1E024, CPU Data Protection Write Enable Register Set 1 */
#define CPU4_DPWE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_1*)0xF889E024u)

/** \brief  1E028, CPU Data Protection Write Enable Register Set 2 */
#define CPU4_DPWE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_2*)0xF889E028u)

/** \brief  1E02C, CPU Data Protection Write Enable Register Set 3 */
#define CPU4_DPWE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_3*)0xF889E02Cu)

/** \brief  1E070, CPU Data Protection Write Enable Register Set 4 */
#define CPU4_DPWE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_4*)0xF889E070u)

/** \brief  1E074, CPU Data Protection Write Enable Register Set 5 */
#define CPU4_DPWE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_5*)0xF889E074u)

/** \brief  19010, CPU Data Synchronous Trap Register */
#define CPU4_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF8899010u)

/** \brief  1FD08, CPU External Event Register */
#define CPU4_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF889FD08u)

/** \brief  1FE38, CPU Free CSA List Head Pointer */
#define CPU4_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF889FE38u)

/** \brief  1100, CPU Flash Configuration Register 0 */
#define CPU4_FLASHCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF8881100u)

/** \brief  1104, CPU Flash Configuration Register 1 */
#define CPU4_FLASHCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF8881104u)

/** \brief  1108, CPU Flash Configuration Register 2 */
#define CPU4_FLASHCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF8881108u)

/** \brief  110C, CPU Flash Configuration Register 3 */
#define CPU4_FLASHCON3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF888110Cu)

/** \brief  1A000, CPU Trap Control Register */
#define CPU4_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF889A000u)

/** \brief  1A008, CPU Trapping Instruction Opcode Register */
#define CPU4_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF889A008u)

/** \brief  1A004, CPU Trapping Instruction Program Counter Register */
#define CPU4_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF889A004u)

/** \brief  1A010, CPU Trapping Instruction Operand Register */
#define CPU4_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF889A010u)

/** \brief  1A014, CPU Trapping Instruction Operand Register */
#define CPU4_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF889A014u)

/** \brief  1A018, CPU Trapping Instruction Operand Register */
#define CPU4_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF889A018u)

/** \brief  1FC08, CPU Instruction Count */
#define CPU4_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF889FC08u)

/** \brief  1FE2C, CPU Interrupt Control Register */
#define CPU4_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF889FE2Cu)

/** \brief  1FE28, CPU Interrupt Stack Pointer */
#define CPU4_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF889FE28u)

/** \brief  D000, CPU Reset Register 0 */
#define CPU4_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST0*)0xF888D000u)

/** \brief  D004, CPU Reset Register 1 */
#define CPU4_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST1*)0xF888D004u)

/** \brief  D008, CPU Reset Status Clear Register */
#define CPU4_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF888D008u)

/** \brief  1FE3C, CPU Free CSA List Limit Pointer */
#define CPU4_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF889FE3Cu)

/** \brief  E110, CPU Safety Protection Region LPB Read Access Enable Register A */
#define CPU4_LPB_SPROT_ACCENA_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF888E110u)

/** \brief  E114, CPU Safety Protection Region LPB Read Access Enable Register B */
#define CPU4_LPB_SPROT_ACCENB_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF888E114u)

/** \brief  1FC0C, CPU Multi-Count Register 1 */
#define CPU4_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF889FC0Cu)

/** \brief  1FC10, CPU Multi-Count Register 2 */
#define CPU4_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF889FC10u)

/** \brief  1FC14, CPU Multi-Count Register 3 */
#define CPU4_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF889FC14u)

/** \brief  18, CPU Overlay Mask Register 0 */
#define CPU4_OMASK0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK0*)0xF8880018u)

/** \brief  24, CPU Overlay Mask Register 1 */
#define CPU4_OMASK1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK1*)0xF8880024u)

/** \brief  90, CPU Overlay Mask Register 10 */
#define CPU4_OMASK10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK10*)0xF8880090u)

/** \brief  9C, CPU Overlay Mask Register 11 */
#define CPU4_OMASK11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK11*)0xF888009Cu)

/** \brief  A8, CPU Overlay Mask Register 12 */
#define CPU4_OMASK12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK12*)0xF88800A8u)

/** \brief  B4, CPU Overlay Mask Register 13 */
#define CPU4_OMASK13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK13*)0xF88800B4u)

/** \brief  C0, CPU Overlay Mask Register 14 */
#define CPU4_OMASK14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK14*)0xF88800C0u)

/** \brief  CC, CPU Overlay Mask Register 15 */
#define CPU4_OMASK15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK15*)0xF88800CCu)

/** \brief  D8, CPU Overlay Mask Register 16 */
#define CPU4_OMASK16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK16*)0xF88800D8u)

