Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E4, CPU Overlay Mask Register 17 */
#define CPU4_OMASK17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK17*)0xF88800E4u)

/** \brief  F0, CPU Overlay Mask Register 18 */
#define CPU4_OMASK18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK18*)0xF88800F0u)

/** \brief  FC, CPU Overlay Mask Register 19 */
#define CPU4_OMASK19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK19*)0xF88800FCu)

/** \brief  30, CPU Overlay Mask Register 2 */
#define CPU4_OMASK2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK2*)0xF8880030u)

/** \brief  108, CPU Overlay Mask Register 20 */
#define CPU4_OMASK20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK20*)0xF8880108u)

/** \brief  114, CPU Overlay Mask Register 21 */
#define CPU4_OMASK21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK21*)0xF8880114u)

/** \brief  120, CPU Overlay Mask Register 22 */
#define CPU4_OMASK22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK22*)0xF8880120u)

/** \brief  12C, CPU Overlay Mask Register 23 */
#define CPU4_OMASK23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK23*)0xF888012Cu)

/** \brief  138, CPU Overlay Mask Register 24 */
#define CPU4_OMASK24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK24*)0xF8880138u)

/** \brief  144, CPU Overlay Mask Register 25 */
#define CPU4_OMASK25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK25*)0xF8880144u)

/** \brief  150, CPU Overlay Mask Register 26 */
#define CPU4_OMASK26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK26*)0xF8880150u)

/** \brief  15C, CPU Overlay Mask Register 27 */
#define CPU4_OMASK27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK27*)0xF888015Cu)

/** \brief  168, CPU Overlay Mask Register 28 */
#define CPU4_OMASK28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK28*)0xF8880168u)

/** \brief  174, CPU Overlay Mask Register 29 */
#define CPU4_OMASK29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK29*)0xF8880174u)

/** \brief  3C, CPU Overlay Mask Register 3 */
#define CPU4_OMASK3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK3*)0xF888003Cu)

/** \brief  180, CPU Overlay Mask Register 30 */
#define CPU4_OMASK30 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK30*)0xF8880180u)

/** \brief  18C, CPU Overlay Mask Register 31 */
#define CPU4_OMASK31 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK31*)0xF888018Cu)

/** \brief  48, CPU Overlay Mask Register 4 */
#define CPU4_OMASK4 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK4*)0xF8880048u)

/** \brief  54, CPU Overlay Mask Register 5 */
#define CPU4_OMASK5 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK5*)0xF8880054u)

/** \brief  60, CPU Overlay Mask Register 6 */
#define CPU4_OMASK6 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK6*)0xF8880060u)

/** \brief  6C, CPU Overlay Mask Register 7 */
#define CPU4_OMASK7 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK7*)0xF888006Cu)

/** \brief  78, CPU Overlay Mask Register 8 */
#define CPU4_OMASK8 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK8*)0xF8880078u)

/** \brief  84, CPU Overlay Mask Register 9 */
#define CPU4_OMASK9 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK9*)0xF8880084u)

/** \brief  0, CPU Overlay Range Select Register */
#define CPU4_OSEL /*lint --e(923)*/ (*(volatile Ifx_CPU_OSEL*)0xF8880000u)

/** \brief  14, CPU Overlay Target Address Register 0 */
#define CPU4_OTAR0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR0*)0xF8880014u)

/** \brief  20, CPU Overlay Target Address Register 1 */
#define CPU4_OTAR1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR1*)0xF8880020u)

/** \brief  8C, CPU Overlay Target Address Register 10 */
#define CPU4_OTAR10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR10*)0xF888008Cu)

/** \brief  98, CPU Overlay Target Address Register 11 */
#define CPU4_OTAR11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR11*)0xF8880098u)

/** \brief  A4, CPU Overlay Target Address Register 12 */
#define CPU4_OTAR12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR12*)0xF88800A4u)

/** \brief  B0, CPU Overlay Target Address Register 13 */
#define CPU4_OTAR13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR13*)0xF88800B0u)

/** \brief  BC, CPU Overlay Target Address Register 14 */
#define CPU4_OTAR14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR14*)0xF88800BCu)

/** \brief  C8, CPU Overlay Target Address Register 15 */
#define CPU4_OTAR15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR15*)0xF88800C8u)

/** \brief  D4, CPU Overlay Target Address Register 16 */
#define CPU4_OTAR16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR16*)0xF88800D4u)

/** \brief  E0, CPU Overlay Target Address Register 17 */
#define CPU4_OTAR17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR17*)0xF88800E0u)

/** \brief  EC, CPU Overlay Target Address Register 18 */
#define CPU4_OTAR18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR18*)0xF88800ECu)

/** \brief  F8, CPU Overlay Target Address Register 19 */
#define CPU4_OTAR19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR19*)0xF88800F8u)

/** \brief  2C, CPU Overlay Target Address Register 2 */
#define CPU4_OTAR2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR2*)0xF888002Cu)

/** \brief  104, CPU Overlay Target Address Register 20 */
#define CPU4_OTAR20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR20*)0xF8880104u)

/** \brief  110, CPU Overlay Target Address Register 21 */
#define CPU4_OTAR21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR21*)0xF8880110u)

/** \brief  11C, CPU Overlay Target Address Register 22 */
#define CPU4_OTAR22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR22*)0xF888011Cu)

/** \brief  128, CPU Overlay Target Address Register 23 */
#define CPU4_OTAR23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR23*)0xF8880128u)

/** \brief  134, CPU Overlay Target Address Register 24 */
#define CPU4_OTAR24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR24*)0xF8880134u)

/** \brief  140, CPU Overlay Target Address Register 25 */
#define CPU4_OTAR25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR25*)0xF8880140u)

/** \brief  14C, CPU Overlay Target Address Register 26 */
#define CPU4_OTAR26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR26*)0xF888014Cu)

/** \brief  158, CPU Overlay Target Address Register 27 */
#define CPU4_OTAR27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR27*)0xF8880158u)

/** \brief  164, CPU Overlay Target Address Register 28 */
#define CPU4_OTAR28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR28*)0xF8880164u)

/** \brief  170, CPU Overlay Target Address Register 29 */
#define CPU4_OTAR29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR29*)0xF8880170u)

/** \brief  38, CPU Overlay Target Address Register 3 */
#define CPU4_OTAR3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR3*)0xF8880038u)

