Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1FF84, CPU Address General Purpose Register */
#define CPU5_A1 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF84u)

/** \brief  1FFA8, CPU Address General Purpose Register */
#define CPU5_A10 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFA8u)

/** \brief  1FFAC, CPU Address General Purpose Register */
#define CPU5_A11 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFACu)

/** \brief  1FFB0, CPU Address General Purpose Register */
#define CPU5_A12 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFB0u)

/** \brief  1FFB4, CPU Address General Purpose Register */
#define CPU5_A13 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFB4u)

/** \brief  1FFB8, CPU Address General Purpose Register */
#define CPU5_A14 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFB8u)

/** \brief  1FFBC, CPU Address General Purpose Register */
#define CPU5_A15 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFBCu)

/** \brief  1FF88, CPU Address General Purpose Register */
#define CPU5_A2 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF88u)

/** \brief  1FF8C, CPU Address General Purpose Register */
#define CPU5_A3 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF8Cu)

/** \brief  1FF90, CPU Address General Purpose Register */
#define CPU5_A4 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF90u)

/** \brief  1FF94, CPU Address General Purpose Register */
#define CPU5_A5 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF94u)

/** \brief  1FF98, CPU Address General Purpose Register */
#define CPU5_A6 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF98u)

/** \brief  1FF9C, CPU Address General Purpose Register */
#define CPU5_A7 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFF9Cu)

/** \brief  1FFA0, CPU Address General Purpose Register */
#define CPU5_A8 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFA0u)

/** \brief  1FFA4, CPU Address General Purpose Register */
#define CPU5_A9 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF88DFFA4u)

/** \brief  1FE20, CPU Base Interrupt Vector Table Pointer */
#define CPU5_BIV /*lint --e(923)*/ (*(volatile Ifx_CPU_BIV*)0xF88DFE20u)

/** \brief  1FE24, CPU Base Trap Vector Table Pointer */
#define CPU5_BTV /*lint --e(923)*/ (*(volatile Ifx_CPU_BTV*)0xF88DFE24u)

/** \brief  1FC04, CPU CPU Clock Cycle Count */
#define CPU5_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF88DFC04u)

/** \brief  1FC00, CPU Counter Control */
#define CPU5_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF88DFC00u)

/** \brief  19400, CPU Compatibility Control Register */
#define CPU5_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF88D9400u)

/** \brief  1FE1C, CPU Core Identification Register */
#define CPU5_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF88DFE1Cu)

/** \brief  1D000, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD000u)

/** \brief  1D004, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD004u)

/** \brief  1D008, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD008u)

/** \brief  1D00C, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD00Cu)

/** \brief  1D010, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD010u)

/** \brief  1D014, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD014u)

/** \brief  1D018, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD018u)

/** \brief  1D01C, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD01Cu)

/** \brief  1D020, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD020u)

/** \brief  1D024, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD024u)

/** \brief  1D028, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD028u)

/** \brief  1D02C, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD02Cu)

/** \brief  1D030, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD030u)

/** \brief  1D034, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD034u)

/** \brief  1D038, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD038u)

/** \brief  1D03C, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD03Cu)

/** \brief  1D040, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD040u)

/** \brief  1D044, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD044u)

/** \brief  1D048, CPU Code Protection Range Lower Bound Register */
#define CPU5_CPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF88DD048u)

/** \brief  1D04C, CPU Code Protection Range Upper Bound Register */
#define CPU5_CPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF88DD04Cu)

/** \brief  1FE18, CPU Identification Register TC1.6P */
#define CPU5_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF88DFE18u)

/** \brief  1E000, CPU Code Protection Execute Enable Register Set 0 */
#define CPU5_CPXE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_0*)0xF88DE000u)

/** \brief  1E004, CPU Code Protection Execute Enable Register Set 1 */
#define CPU5_CPXE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_1*)0xF88DE004u)

