Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E008, CPU Code Protection Execute Enable Register Set 2 */
#define CPU5_CPXE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_2*)0xF88DE008u)

/** \brief  1E00C, CPU Code Protection Execute Enable Register Set 3 */
#define CPU5_CPXE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_3*)0xF88DE00Cu)

/** \brief  1E050, CPU Code Protection Execute Enable Register Set 4 */
#define CPU5_CPXE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_4*)0xF88DE050u)

/** \brief  1E054, CPU Code Protection Execute Enable Register Set 5 */
#define CPU5_CPXE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE_5*)0xF88DE054u)

/** \brief  1FD0C, CPU Core Register Access Event */
#define CPU5_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF88DFD0Cu)

/** \brief  1FE50, CPU Customer ID register */
#define CPU5_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF88DFE50u)

/** \brief  1FF00, CPU Data General Purpose Register */
#define CPU5_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF00u)

/** \brief  1FF04, CPU Data General Purpose Register */
#define CPU5_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF04u)

/** \brief  1FF28, CPU Data General Purpose Register */
#define CPU5_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF28u)

/** \brief  1FF2C, CPU Data General Purpose Register */
#define CPU5_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF2Cu)

/** \brief  1FF30, CPU Data General Purpose Register */
#define CPU5_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF30u)

/** \brief  1FF34, CPU Data General Purpose Register */
#define CPU5_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF34u)

/** \brief  1FF38, CPU Data General Purpose Register */
#define CPU5_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF38u)

/** \brief  1FF3C, CPU Data General Purpose Register */
#define CPU5_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF3Cu)

/** \brief  1FF08, CPU Data General Purpose Register */
#define CPU5_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF08u)

/** \brief  1FF0C, CPU Data General Purpose Register */
#define CPU5_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF0Cu)

/** \brief  1FF10, CPU Data General Purpose Register */
#define CPU5_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF10u)

/** \brief  1FF14, CPU Data General Purpose Register */
#define CPU5_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF14u)

/** \brief  1FF18, CPU Data General Purpose Register */
#define CPU5_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF18u)

/** \brief  1FF1C, CPU Data General Purpose Register */
#define CPU5_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF1Cu)

/** \brief  1FF20, CPU Data General Purpose Register */
#define CPU5_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF20u)

/** \brief  1FF24, CPU Data General Purpose Register */
#define CPU5_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF88DFF24u)

/** \brief  19018, CPU Data Asynchronous Trap Register */
#define CPU5_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF88D9018u)

/** \brief  1FD00, CPU Debug Status Register */
#define CPU5_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF88DFD00u)

/** \brief  1FD48, CPU Debug Trap Control Register */
#define CPU5_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF88DFD48u)

/** \brief  19040, CPU Data Memory Control Register */
#define CPU5_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF88D9040u)

/** \brief  19000, CPU Data Control Register 2 */
#define CPU5_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF88D9000u)

/** \brief  1FD44, CPU Debug Context Save Area Pointer */
#define CPU5_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF88DFD44u)

/** \brief  1901C, CPU Data Error Address Register */
#define CPU5_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF88D901Cu)

/** \brief  19020, CPU Data Integrity Error Address Register */
#define CPU5_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF88D9020u)

/** \brief  19024, CPU Data Integrity Error Trap Register */
#define CPU5_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF88D9024u)

/** \brief  E208, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN0_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE208u)

/** \brief  E20C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN0_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE20Cu)

/** \brief  E200, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE200u)

/** \brief  E204, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE204u)

/** \brief  E218, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN1_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE218u)

/** \brief  E21C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN1_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE21Cu)

/** \brief  E210, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE210u)

/** \brief  E214, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE214u)

/** \brief  E228, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN2_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE228u)

/** \brief  E22C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN2_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE22Cu)

/** \brief  E220, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE220u)

/** \brief  E224, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE224u)

