Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E238, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN3_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE238u)

/** \brief  E23C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN3_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE23Cu)

/** \brief  E230, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE230u)

/** \brief  E234, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE234u)

/** \brief  E248, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN4_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE248u)

/** \brief  E24C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN4_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE24Cu)

/** \brief  E240, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE240u)

/** \brief  E244, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE244u)

/** \brief  E258, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN5_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE258u)

/** \brief  E25C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN5_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE25Cu)

/** \brief  E250, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE250u)

/** \brief  E254, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE254u)

/** \brief  E268, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN6_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE268u)

/** \brief  E26C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN6_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE26Cu)

/** \brief  E260, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE260u)

/** \brief  E264, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE264u)

/** \brief  E278, CPU Safety Protection Region DLMU Write Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGN7_ACCENA_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W*)0xF88CE278u)

/** \brief  E27C, CPU Safety Protection Region DLMU Write Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGN7_ACCENB_W /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W*)0xF88CE27Cu)

/** \brief  E270, CPU Safety Protection DLMU Region Lower Address Register */
#define CPU5_DLMU_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_LA*)0xF88CE270u)

/** \brief  E274, CPU Safety protection DLMU Region Upper Address Register */
#define CPU5_DLMU_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGN_UA*)0xF88CE274u)

/** \brief  E288, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA0_R*)0xF88CE288u)

/** \brief  E298, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA1_R*)0xF88CE298u)

/** \brief  E2A8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA2_R*)0xF88CE2A8u)

/** \brief  E2B8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA3_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA3_R*)0xF88CE2B8u)

/** \brief  E2C8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA4_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA4_R*)0xF88CE2C8u)

/** \brief  E2D8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA5_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA5_R*)0xF88CE2D8u)

/** \brief  E2E8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA6_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA6_R*)0xF88CE2E8u)

/** \brief  E2F8, CPU Safety Protection Region DLMU Read Access Enable Register
 * A */
#define CPU5_DLMU_SPROT_RGNACCENA7_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENA7_R*)0xF88CE2F8u)

/** \brief  E28C, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGNACCENB0_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB0_R*)0xF88CE28Cu)

/** \brief  E29C, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGNACCENB1_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB1_R*)0xF88CE29Cu)

/** \brief  E2AC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGNACCENB2_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB2_R*)0xF88CE2ACu)

/** \brief  E2BC, CPU Safety Protection Region DLMU Read Access Enable Register
 * B */
#define CPU5_DLMU_SPROT_RGNACCENB3_R /*lint --e(923)*/ (*(volatile Ifx_CPU_DLMU_SPROT_RGNACCENB3_R*)0xF88CE2BCu)

