Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E01C, CPU Data Protection Read Enable Register Set 3 */
#define CPU5_DPRE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_3*)0xF88DE01Cu)

/** \brief  1E060, CPU Data Protection Read Enable Register Set 4 */
#define CPU5_DPRE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_4*)0xF88DE060u)

/** \brief  1E064, CPU Data Protection Read Enable Register Set 5 */
#define CPU5_DPRE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE_5*)0xF88DE064u)

/** \brief  1E020, CPU Data Protection Write Enable Register Set 0 */
#define CPU5_DPWE_0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_0*)0xF88DE020u)

/** \brief  1E024, CPU Data Protection Write Enable Register Set 1 */
#define CPU5_DPWE_1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_1*)0xF88DE024u)

/** \brief  1E028, CPU Data Protection Write Enable Register Set 2 */
#define CPU5_DPWE_2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_2*)0xF88DE028u)

/** \brief  1E02C, CPU Data Protection Write Enable Register Set 3 */
#define CPU5_DPWE_3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_3*)0xF88DE02Cu)

/** \brief  1E070, CPU Data Protection Write Enable Register Set 4 */
#define CPU5_DPWE_4 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_4*)0xF88DE070u)

/** \brief  1E074, CPU Data Protection Write Enable Register Set 5 */
#define CPU5_DPWE_5 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE_5*)0xF88DE074u)

/** \brief  19010, CPU Data Synchronous Trap Register */
#define CPU5_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF88D9010u)

/** \brief  1FD08, CPU External Event Register */
#define CPU5_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF88DFD08u)

/** \brief  1FE38, CPU Free CSA List Head Pointer */
#define CPU5_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF88DFE38u)

/** \brief  1100, CPU Flash Configuration Register 0 */
#define CPU5_FLASHCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF88C1100u)

/** \brief  1104, CPU Flash Configuration Register 1 */
#define CPU5_FLASHCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF88C1104u)

/** \brief  1108, CPU Flash Configuration Register 2 */
#define CPU5_FLASHCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF88C1108u)

/** \brief  110C, CPU Flash Configuration Register 3 */
#define CPU5_FLASHCON3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF88C110Cu)

/** \brief  1A000, CPU Trap Control Register */
#define CPU5_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF88DA000u)

/** \brief  1A008, CPU Trapping Instruction Opcode Register */
#define CPU5_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF88DA008u)

/** \brief  1A004, CPU Trapping Instruction Program Counter Register */
#define CPU5_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF88DA004u)

/** \brief  1A010, CPU Trapping Instruction Operand Register */
#define CPU5_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF88DA010u)

/** \brief  1A014, CPU Trapping Instruction Operand Register */
#define CPU5_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF88DA014u)

/** \brief  1A018, CPU Trapping Instruction Operand Register */
#define CPU5_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF88DA018u)

/** \brief  1FC08, CPU Instruction Count */
#define CPU5_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF88DFC08u)

/** \brief  1FE2C, CPU Interrupt Control Register */
#define CPU5_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF88DFE2Cu)

/** \brief  1FE28, CPU Interrupt Stack Pointer */
#define CPU5_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF88DFE28u)

/** \brief  D000, CPU Reset Register 0 */
#define CPU5_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST0*)0xF88CD000u)

/** \brief  D004, CPU Reset Register 1 */
#define CPU5_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CPU_KRST1*)0xF88CD004u)

/** \brief  D008, CPU Reset Status Clear Register */
#define CPU5_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF88CD008u)

/** \brief  1FE3C, CPU Free CSA List Limit Pointer */
#define CPU5_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF88DFE3Cu)

/** \brief  E110, CPU Safety Protection Region LPB Read Access Enable Register A */
#define CPU5_LPB_SPROT_ACCENA_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENA_R*)0xF88CE110u)

/** \brief  E114, CPU Safety Protection Region LPB Read Access Enable Register B */
#define CPU5_LPB_SPROT_ACCENB_R /*lint --e(923)*/ (*(volatile Ifx_CPU_LPB_SPROT_ACCENB_R*)0xF88CE114u)

/** \brief  1FC0C, CPU Multi-Count Register 1 */
#define CPU5_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF88DFC0Cu)

/** \brief  1FC10, CPU Multi-Count Register 2 */
#define CPU5_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF88DFC10u)

/** \brief  1FC14, CPU Multi-Count Register 3 */
#define CPU5_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF88DFC14u)

/** \brief  18, CPU Overlay Mask Register 0 */
#define CPU5_OMASK0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK0*)0xF88C0018u)

/** \brief  24, CPU Overlay Mask Register 1 */
#define CPU5_OMASK1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK1*)0xF88C0024u)

/** \brief  90, CPU Overlay Mask Register 10 */
#define CPU5_OMASK10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK10*)0xF88C0090u)

/** \brief  9C, CPU Overlay Mask Register 11 */
#define CPU5_OMASK11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK11*)0xF88C009Cu)

/** \brief  A8, CPU Overlay Mask Register 12 */
#define CPU5_OMASK12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK12*)0xF88C00A8u)

/** \brief  B4, CPU Overlay Mask Register 13 */
#define CPU5_OMASK13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK13*)0xF88C00B4u)

/** \brief  C0, CPU Overlay Mask Register 14 */
#define CPU5_OMASK14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK14*)0xF88C00C0u)

/** \brief  CC, CPU Overlay Mask Register 15 */
#define CPU5_OMASK15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK15*)0xF88C00CCu)

/** \brief  D8, CPU Overlay Mask Register 16 */
#define CPU5_OMASK16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK16*)0xF88C00D8u)

