Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E4, CPU Overlay Mask Register 17 */
#define CPU5_OMASK17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK17*)0xF88C00E4u)

/** \brief  F0, CPU Overlay Mask Register 18 */
#define CPU5_OMASK18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK18*)0xF88C00F0u)

/** \brief  FC, CPU Overlay Mask Register 19 */
#define CPU5_OMASK19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK19*)0xF88C00FCu)

/** \brief  30, CPU Overlay Mask Register 2 */
#define CPU5_OMASK2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK2*)0xF88C0030u)

/** \brief  108, CPU Overlay Mask Register 20 */
#define CPU5_OMASK20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK20*)0xF88C0108u)

/** \brief  114, CPU Overlay Mask Register 21 */
#define CPU5_OMASK21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK21*)0xF88C0114u)

/** \brief  120, CPU Overlay Mask Register 22 */
#define CPU5_OMASK22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK22*)0xF88C0120u)

/** \brief  12C, CPU Overlay Mask Register 23 */
#define CPU5_OMASK23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK23*)0xF88C012Cu)

/** \brief  138, CPU Overlay Mask Register 24 */
#define CPU5_OMASK24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK24*)0xF88C0138u)

/** \brief  144, CPU Overlay Mask Register 25 */
#define CPU5_OMASK25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK25*)0xF88C0144u)

/** \brief  150, CPU Overlay Mask Register 26 */
#define CPU5_OMASK26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK26*)0xF88C0150u)

/** \brief  15C, CPU Overlay Mask Register 27 */
#define CPU5_OMASK27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK27*)0xF88C015Cu)

/** \brief  168, CPU Overlay Mask Register 28 */
#define CPU5_OMASK28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK28*)0xF88C0168u)

/** \brief  174, CPU Overlay Mask Register 29 */
#define CPU5_OMASK29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK29*)0xF88C0174u)

/** \brief  3C, CPU Overlay Mask Register 3 */
#define CPU5_OMASK3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK3*)0xF88C003Cu)

/** \brief  180, CPU Overlay Mask Register 30 */
#define CPU5_OMASK30 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK30*)0xF88C0180u)

/** \brief  18C, CPU Overlay Mask Register 31 */
#define CPU5_OMASK31 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK31*)0xF88C018Cu)

/** \brief  48, CPU Overlay Mask Register 4 */
#define CPU5_OMASK4 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK4*)0xF88C0048u)

/** \brief  54, CPU Overlay Mask Register 5 */
#define CPU5_OMASK5 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK5*)0xF88C0054u)

/** \brief  60, CPU Overlay Mask Register 6 */
#define CPU5_OMASK6 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK6*)0xF88C0060u)

/** \brief  6C, CPU Overlay Mask Register 7 */
#define CPU5_OMASK7 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK7*)0xF88C006Cu)

/** \brief  78, CPU Overlay Mask Register 8 */
#define CPU5_OMASK8 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK8*)0xF88C0078u)

/** \brief  84, CPU Overlay Mask Register 9 */
#define CPU5_OMASK9 /*lint --e(923)*/ (*(volatile Ifx_CPU_OMASK9*)0xF88C0084u)

/** \brief  0, CPU Overlay Range Select Register */
#define CPU5_OSEL /*lint --e(923)*/ (*(volatile Ifx_CPU_OSEL*)0xF88C0000u)

/** \brief  14, CPU Overlay Target Address Register 0 */
#define CPU5_OTAR0 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR0*)0xF88C0014u)

/** \brief  20, CPU Overlay Target Address Register 1 */
#define CPU5_OTAR1 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR1*)0xF88C0020u)

/** \brief  8C, CPU Overlay Target Address Register 10 */
#define CPU5_OTAR10 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR10*)0xF88C008Cu)

/** \brief  98, CPU Overlay Target Address Register 11 */
#define CPU5_OTAR11 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR11*)0xF88C0098u)

/** \brief  A4, CPU Overlay Target Address Register 12 */
#define CPU5_OTAR12 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR12*)0xF88C00A4u)

/** \brief  B0, CPU Overlay Target Address Register 13 */
#define CPU5_OTAR13 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR13*)0xF88C00B0u)

/** \brief  BC, CPU Overlay Target Address Register 14 */
#define CPU5_OTAR14 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR14*)0xF88C00BCu)

/** \brief  C8, CPU Overlay Target Address Register 15 */
#define CPU5_OTAR15 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR15*)0xF88C00C8u)

/** \brief  D4, CPU Overlay Target Address Register 16 */
#define CPU5_OTAR16 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR16*)0xF88C00D4u)

/** \brief  E0, CPU Overlay Target Address Register 17 */
#define CPU5_OTAR17 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR17*)0xF88C00E0u)

/** \brief  EC, CPU Overlay Target Address Register 18 */
#define CPU5_OTAR18 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR18*)0xF88C00ECu)

/** \brief  F8, CPU Overlay Target Address Register 19 */
#define CPU5_OTAR19 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR19*)0xF88C00F8u)

/** \brief  2C, CPU Overlay Target Address Register 2 */
#define CPU5_OTAR2 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR2*)0xF88C002Cu)

/** \brief  104, CPU Overlay Target Address Register 20 */
#define CPU5_OTAR20 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR20*)0xF88C0104u)

/** \brief  110, CPU Overlay Target Address Register 21 */
#define CPU5_OTAR21 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR21*)0xF88C0110u)

/** \brief  11C, CPU Overlay Target Address Register 22 */
#define CPU5_OTAR22 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR22*)0xF88C011Cu)

/** \brief  128, CPU Overlay Target Address Register 23 */
#define CPU5_OTAR23 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR23*)0xF88C0128u)

/** \brief  134, CPU Overlay Target Address Register 24 */
#define CPU5_OTAR24 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR24*)0xF88C0134u)

/** \brief  140, CPU Overlay Target Address Register 25 */
#define CPU5_OTAR25 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR25*)0xF88C0140u)

/** \brief  14C, CPU Overlay Target Address Register 26 */
#define CPU5_OTAR26 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR26*)0xF88C014Cu)

/** \brief  158, CPU Overlay Target Address Register 27 */
#define CPU5_OTAR27 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR27*)0xF88C0158u)

/** \brief  164, CPU Overlay Target Address Register 28 */
#define CPU5_OTAR28 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR28*)0xF88C0164u)

/** \brief  170, CPU Overlay Target Address Register 29 */
#define CPU5_OTAR29 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR29*)0xF88C0170u)

/** \brief  38, CPU Overlay Target Address Register 3 */
#define CPU5_OTAR3 /*lint --e(923)*/ (*(volatile Ifx_CPU_OTAR3*)0xF88C0038u)

