Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E208, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN0_ACCENA_W 0xE208

/** \brief  E20C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN0_ACCENB_W 0xE20C

/** \brief  E200, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN0_LA 0xE200

/** \brief  E204, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN0_UA 0xE204

/** \brief  E218, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN1_ACCENA_W 0xE218

/** \brief  E21C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN1_ACCENB_W 0xE21C

/** \brief  E210, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN1_LA 0xE210

/** \brief  E214, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN1_UA 0xE214

/** \brief  E228, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN2_ACCENA_W 0xE228

/** \brief  E22C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN2_ACCENB_W 0xE22C

/** \brief  E220, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN2_LA 0xE220

/** \brief  E224, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN2_UA 0xE224

/** \brief  E238, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN3_ACCENA_W 0xE238

/** \brief  E23C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN3_ACCENB_W 0xE23C

/** \brief  E230, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN3_LA 0xE230

/** \brief  E234, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN3_UA 0xE234

/** \brief  E248, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN4_ACCENA_W 0xE248

/** \brief  E24C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN4_ACCENB_W 0xE24C

/** \brief  E240, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN4_LA 0xE240

/** \brief  E244, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN4_UA 0xE244

/** \brief  E258, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN5_ACCENA_W 0xE258

/** \brief  E25C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN5_ACCENB_W 0xE25C

/** \brief  E250, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN5_LA 0xE250

/** \brief  E254, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN5_UA 0xE254

/** \brief  E268, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN6_ACCENA_W 0xE268

/** \brief  E26C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN6_ACCENB_W 0xE26C

/** \brief  E260, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN6_LA 0xE260

/** \brief  E264, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN6_UA 0xE264

/** \brief  E278, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register A */
#define CPU_DLMU_SPROT_RGN7_ACCENA_W 0xE278

/** \brief  E27C, , type: Ifx_CPU_DLMU_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region DLMU Write Access Enable Register B */
#define CPU_DLMU_SPROT_RGN7_ACCENB_W 0xE27C

/** \brief  E270, , type: Ifx_CPU_DLMU_SPROT_RGN_LA, CPU Safety Protection DLMU
 * Region Lower Address Register */
#define CPU_DLMU_SPROT_RGN7_LA 0xE270

/** \brief  E274, , type: Ifx_CPU_DLMU_SPROT_RGN_UA, CPU Safety protection DLMU
 * Region Upper Address Register */
#define CPU_DLMU_SPROT_RGN7_UA 0xE274

/** \brief  E288, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA0_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA0_R 0xE288

/** \brief  E298, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA1_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA1_R 0xE298

/** \brief  E2A8, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA2_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA2_R 0xE2A8

/** \brief  E2B8, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA3_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA3_R 0xE2B8

/** \brief  E2C8, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA4_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA4_R 0xE2C8

