Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E2D8, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA5_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA5_R 0xE2D8

/** \brief  E2E8, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA6_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA6_R 0xE2E8

/** \brief  E2F8, , type: Ifx_CPU_DLMU_SPROT_RGNACCENA7_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register A */
#define CPU_DLMU_SPROT_RGNACCENA7_R 0xE2F8

/** \brief  E28C, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB0_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB0_R 0xE28C

/** \brief  E29C, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB1_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB1_R 0xE29C

/** \brief  E2AC, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB2_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB2_R 0xE2AC

/** \brief  E2BC, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB3_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB3_R 0xE2BC

/** \brief  E2CC, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB4_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB4_R 0xE2CC

/** \brief  E2DC, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB5_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB5_R 0xE2DC

/** \brief  E2EC, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB6_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB6_R 0xE2EC

/** \brief  E2FC, , type: Ifx_CPU_DLMU_SPROT_RGNACCENB7_R, CPU Safety Protection
 * Region DLMU Read Access Enable Register B */
#define CPU_DLMU_SPROT_RGNACCENB7_R 0xE2FC

/** \brief  E100, , type: Ifx_CPU_SFR_SPROT_ACCENA_W, CPU Safety Protection
 * Register Access Enable Register A */
#define CPU_SFR_SPROT_ACCENA_W 0xE100

/** \brief  E104, , type: Ifx_CPU_SFR_SPROT_ACCENB_W, CPU Safety Protection
 * Region Access Enable Register B */
#define CPU_SFR_SPROT_ACCENB_W 0xE104

/** \brief  1900C, , type: Ifx_CPU_SMACON, CPU SIST Mode Access Control Register */
#define CPU_SMACON 0x1900C

/** \brief  E008, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN0_ACCENA_W 0xE008

/** \brief  E00C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN0_ACCENB_W 0xE00C

/** \brief  E000, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN0_LA 0xE000

/** \brief  E004, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN0_UA 0xE004

/** \brief  E018, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN1_ACCENA_W 0xE018

/** \brief  E01C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN1_ACCENB_W 0xE01C

/** \brief  E010, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN1_LA 0xE010

/** \brief  E014, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN1_UA 0xE014

/** \brief  E028, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN2_ACCENA_W 0xE028

/** \brief  E02C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN2_ACCENB_W 0xE02C

/** \brief  E020, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN2_LA 0xE020

/** \brief  E024, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN2_UA 0xE024

/** \brief  E038, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN3_ACCENA_W 0xE038

/** \brief  E03C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN3_ACCENB_W 0xE03C

/** \brief  E030, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN3_LA 0xE030

/** \brief  E034, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN3_UA 0xE034

/** \brief  E048, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN4_ACCENA_W 0xE048

/** \brief  E04C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN4_ACCENB_W 0xE04C

/** \brief  E040, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN4_LA 0xE040

/** \brief  E044, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN4_UA 0xE044

/** \brief  E058, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN5_ACCENA_W 0xE058

/** \brief  E05C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN5_ACCENB_W 0xE05C

/** \brief  E050, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN5_LA 0xE050

/** \brief  E054, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN5_UA 0xE054

