Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  E068, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN6_ACCENA_W 0xE068

/** \brief  E06C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN6_ACCENB_W 0xE06C

/** \brief  E060, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN6_LA 0xE060

/** \brief  E064, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN6_UA 0xE064

/** \brief  E078, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENA_W, CPU Safety Protection
 * Region SPR Write Access Enable Register A */
#define CPU_SPR_SPROT_RGN7_ACCENA_W 0xE078

/** \brief  E07C, , type: Ifx_CPU_SPR_SPROT_RGN_ACCENB_W, CPU Safety Protection
 * Region SPR Write Access Enable Register B */
#define CPU_SPR_SPROT_RGN7_ACCENB_W 0xE07C

/** \brief  E070, , type: Ifx_CPU_SPR_SPROT_RGN_LA, CPU Safety Protection SPR
 * Region Lower Address Register */
#define CPU_SPR_SPROT_RGN7_LA 0xE070

/** \brief  E074, , type: Ifx_CPU_SPR_SPROT_RGN_UA, CPU Safety protection SPR
 * Region Upper Address Register */
#define CPU_SPR_SPROT_RGN7_UA 0xE074

/** \brief  E088, , type: Ifx_CPU_SPR_SPROT_RGNACCENA0_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA0_R 0xE088

/** \brief  E098, , type: Ifx_CPU_SPR_SPROT_RGNACCENA1_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA1_R 0xE098

/** \brief  E0A8, , type: Ifx_CPU_SPR_SPROT_RGNACCENA2_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA2_R 0xE0A8

/** \brief  E0B8, , type: Ifx_CPU_SPR_SPROT_RGNACCENA3_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA3_R 0xE0B8

/** \brief  E0C8, , type: Ifx_CPU_SPR_SPROT_RGNACCENA4_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA4_R 0xE0C8

/** \brief  E0D8, , type: Ifx_CPU_SPR_SPROT_RGNACCENA5_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA5_R 0xE0D8

/** \brief  E0E8, , type: Ifx_CPU_SPR_SPROT_RGNACCENA6_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA6_R 0xE0E8

/** \brief  E0F8, , type: Ifx_CPU_SPR_SPROT_RGNACCENA7_R, CPU Safety Protection
 * Region SPR Read Access Enable Register A */
#define CPU_SPR_SPROT_RGNACCENA7_R 0xE0F8

/** \brief  E08C, , type: Ifx_CPU_SPR_SPROT_RGNACCENB0_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB0_R 0xE08C

/** \brief  E09C, , type: Ifx_CPU_SPR_SPROT_RGNACCENB1_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB1_R 0xE09C

/** \brief  E0AC, , type: Ifx_CPU_SPR_SPROT_RGNACCENB2_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB2_R 0xE0AC

/** \brief  E0BC, , type: Ifx_CPU_SPR_SPROT_RGNACCENB3_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB3_R 0xE0BC

/** \brief  E0CC, , type: Ifx_CPU_SPR_SPROT_RGNACCENB4_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB4_R 0xE0CC

/** \brief  E0DC, , type: Ifx_CPU_SPR_SPROT_RGNACCENB5_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB5_R 0xE0DC

/** \brief  E0EC, , type: Ifx_CPU_SPR_SPROT_RGNACCENB6_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB6_R 0xE0EC

/** \brief  E0FC, , type: Ifx_CPU_SPR_SPROT_RGNACCENB7_R, CPU Safety Protection
 * Region SPR Read Access Enable Register B */
#define CPU_SPR_SPROT_RGNACCENB7_R 0xE0FC

/** \brief  E110, , type: Ifx_CPU_LPB_SPROT_ACCENA_R, CPU Safety Protection
 * Region LPB Read Access Enable Register A */
#define CPU_LPB_SPROT_ACCENA_R 0xE110

/** \brief  E114, , type: Ifx_CPU_LPB_SPROT_ACCENB_R, CPU Safety Protection
 * Region LPB Read Access Enable Register B */
#define CPU_LPB_SPROT_ACCENB_R 0xE114

/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu
 * \{  */

/** \brief  FF80, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A0            0xFF80

/** \brief  FF84, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A1            0xFF84

/** \brief  FFA8, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A10           0xFFA8

/** \brief  FFAC, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A11           0xFFAC

/** \brief  FFB0, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A12           0xFFB0

/** \brief  FFB4, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A13           0xFFB4

/** \brief  FFB8, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A14           0xFFB8

/** \brief  FFBC, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A15           0xFFBC

/** \brief  FF88, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A2            0xFF88

/** \brief  FF8C, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A3            0xFF8C

/** \brief  FF90, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A4            0xFF90

/** \brief  FF94, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A5            0xFF94

/** \brief  FF98, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A6            0xFF98

/** \brief  FF9C, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A7            0xFF9C

/** \brief  FFA0, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A8            0xFFA0

/** \brief  FFA4, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A9            0xFFA4

/** \brief  FE20, , type: Ifx_CPU_BIV, Base Interrupt Vector Table Pointer */
#define CPU_BIV           0xFE20

/** \brief  FE24, , type: Ifx_CPU_BTV, Base Trap Vector Table Pointer */
#define CPU_BTV           0xFE24

