Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  1E074, , type: Ifx_CPU_DPWE_5, CPU Data Protection Write Enable
 * Register Set 5 */
#define CPU_DPWE_5 0xE074

/** \brief  19010, , type: Ifx_CPU_DSTR, CPU Data Synchronous Trap Register */
#define CPU_DSTR 0x9010

/** \brief  1FD08, , type: Ifx_CPU_EXEVT, CPU External Event Register */
#define CPU_EXEVT 0xFD08

/** \brief  1FE38, , type: Ifx_CPU_FCX, CPU Free CSA List Head Pointer */
#define CPU_FCX 0xFE38

/** \brief  1100, , type: Ifx_CPU_FLASHCON0, CPU Flash Configuration Register 0 */
#define CPU_FLASHCON0 0x100

/** \brief  1104, , type: Ifx_CPU_FLASHCON1, CPU Flash Configuration Register 1 */
#define CPU_FLASHCON1 0x104

/** \brief  1108, , type: Ifx_CPU_FLASHCON2, CPU Flash Configuration Register 2 */
#define CPU_FLASHCON2 0x108

/** \brief  110C, , type: Ifx_CPU_FLASHCON3, CPU Flash Configuration Register 3 */
#define CPU_FLASHCON3 0x10C

/** \brief  1A000, , type: Ifx_CPU_FPU_TRAP_CON, CPU Trap Control Register */
#define CPU_FPU_TRAP_CON 0xA000

/** \brief  1A008, , type: Ifx_CPU_FPU_TRAP_OPC, CPU Trapping Instruction Opcode
 * Register */
#define CPU_FPU_TRAP_OPC 0xA008

/** \brief  1A004, , type: Ifx_CPU_FPU_TRAP_PC, CPU Trapping Instruction Program
 * Counter Register */
#define CPU_FPU_TRAP_PC 0xA004

/** \brief  1A010, , type: Ifx_CPU_FPU_TRAP_SRC1, CPU Trapping Instruction
 * Operand Register */
#define CPU_FPU_TRAP_SRC1 0xA010

/** \brief  1A014, , type: Ifx_CPU_FPU_TRAP_SRC2, CPU Trapping Instruction
 * Operand Register */
#define CPU_FPU_TRAP_SRC2 0xA014

/** \brief  1A018, , type: Ifx_CPU_FPU_TRAP_SRC3, CPU Trapping Instruction
 * Operand Register */
#define CPU_FPU_TRAP_SRC3 0xA018

/** \brief  1FC08, , type: Ifx_CPU_ICNT, CPU Instruction Count */
#define CPU_ICNT 0xFC08

/** \brief  1FE2C, , type: Ifx_CPU_ICR, CPU Interrupt Control Register */
#define CPU_ICR 0xFE2C

/** \brief  1FE28, , type: Ifx_CPU_ISP, CPU Interrupt Stack Pointer */
#define CPU_ISP 0xFE28

/** \brief  D000, , type: Ifx_CPU_KRST0, CPU Reset Register 0 */
#define CPU_KRST0 0xD000

/** \brief  D004, , type: Ifx_CPU_KRST1, CPU Reset Register 1 */
#define CPU_KRST1 0xD004

/** \brief  D008, , type: Ifx_CPU_KRSTCLR, CPU Reset Status Clear Register */
#define CPU_KRSTCLR 0xD008

/** \brief  1FE3C, , type: Ifx_CPU_LCX, CPU Free CSA List Limit Pointer */
#define CPU_LCX 0xFE3C

/** \brief  1FC0C, , type: Ifx_CPU_M1CNT, CPU Multi-Count Register 1 */
#define CPU_M1CNT 0xFC0C

/** \brief  1FC10, , type: Ifx_CPU_M2CNT, CPU Multi-Count Register 2 */
#define CPU_M2CNT 0xFC10

/** \brief  1FC14, , type: Ifx_CPU_M3CNT, CPU Multi-Count Register 3 */
#define CPU_M3CNT 0xFC14

/** \brief  18, , type: Ifx_CPU_OMASK0, CPU Overlay Mask Register 0 */
#define CPU_OMASK0 0x18

/** \brief  24, , type: Ifx_CPU_OMASK1, CPU Overlay Mask Register 1 */
#define CPU_OMASK1 0x24

/** \brief  90, , type: Ifx_CPU_OMASK10, CPU Overlay Mask Register 10 */
#define CPU_OMASK10 0x90

/** \brief  9C, , type: Ifx_CPU_OMASK11, CPU Overlay Mask Register 11 */
#define CPU_OMASK11 0x9C

/** \brief  A8, , type: Ifx_CPU_OMASK12, CPU Overlay Mask Register 12 */
#define CPU_OMASK12 0xA8

/** \brief  B4, , type: Ifx_CPU_OMASK13, CPU Overlay Mask Register 13 */
#define CPU_OMASK13 0xB4

/** \brief  C0, , type: Ifx_CPU_OMASK14, CPU Overlay Mask Register 14 */
#define CPU_OMASK14 0xC0

/** \brief  CC, , type: Ifx_CPU_OMASK15, CPU Overlay Mask Register 15 */
#define CPU_OMASK15 0xCC

/** \brief  D8, , type: Ifx_CPU_OMASK16, CPU Overlay Mask Register 16 */
#define CPU_OMASK16 0xD8

/** \brief  E4, , type: Ifx_CPU_OMASK17, CPU Overlay Mask Register 17 */
#define CPU_OMASK17 0xE4

/** \brief  F0, , type: Ifx_CPU_OMASK18, CPU Overlay Mask Register 18 */
#define CPU_OMASK18 0xF0

/** \brief  FC, , type: Ifx_CPU_OMASK19, CPU Overlay Mask Register 19 */
#define CPU_OMASK19 0xFC

/** \brief  30, , type: Ifx_CPU_OMASK2, CPU Overlay Mask Register 2 */
#define CPU_OMASK2 0x30

/** \brief  108, , type: Ifx_CPU_OMASK20, CPU Overlay Mask Register 20 */
#define CPU_OMASK20 0x108

/** \brief  114, , type: Ifx_CPU_OMASK21, CPU Overlay Mask Register 21 */
#define CPU_OMASK21 0x114

/** \brief  120, , type: Ifx_CPU_OMASK22, CPU Overlay Mask Register 22 */
#define CPU_OMASK22 0x120

/** \brief  12C, , type: Ifx_CPU_OMASK23, CPU Overlay Mask Register 23 */
#define CPU_OMASK23 0x12C

/** \brief  138, , type: Ifx_CPU_OMASK24, CPU Overlay Mask Register 24 */
#define CPU_OMASK24 0x138

/** \brief  144, , type: Ifx_CPU_OMASK25, CPU Overlay Mask Register 25 */
#define CPU_OMASK25 0x144

/** \brief  150, , type: Ifx_CPU_OMASK26, CPU Overlay Mask Register 26 */
#define CPU_OMASK26 0x150

/** \brief  15C, , type: Ifx_CPU_OMASK27, CPU Overlay Mask Register 27 */
#define CPU_OMASK27 0x15C

/** \brief  168, , type: Ifx_CPU_OMASK28, CPU Overlay Mask Register 28 */
#define CPU_OMASK28 0x168

/** \brief  174, , type: Ifx_CPU_OMASK29, CPU Overlay Mask Register 29 */
#define CPU_OMASK29 0x174

/** \brief  3C, , type: Ifx_CPU_OMASK3, CPU Overlay Mask Register 3 */
#define CPU_OMASK3 0x3C

/** \brief  180, , type: Ifx_CPU_OMASK30, CPU Overlay Mask Register 30 */
#define CPU_OMASK30 0x180

/** \brief  18C, , type: Ifx_CPU_OMASK31, CPU Overlay Mask Register 31 */
#define CPU_OMASK31 0x18C

/** \brief  48, , type: Ifx_CPU_OMASK4, CPU Overlay Mask Register 4 */
#define CPU_OMASK4 0x48

/** \brief  54, , type: Ifx_CPU_OMASK5, CPU Overlay Mask Register 5 */
#define CPU_OMASK5 0x54

/** \brief  60, , type: Ifx_CPU_OMASK6, CPU Overlay Mask Register 6 */
#define CPU_OMASK6 0x60

/** \brief  6C, , type: Ifx_CPU_OMASK7, CPU Overlay Mask Register 7 */
#define CPU_OMASK7 0x6C

/** \brief  78, , type: Ifx_CPU_OMASK8, CPU Overlay Mask Register 8 */
#define CPU_OMASK8 0x78

/** \brief  84, , type: Ifx_CPU_OMASK9, CPU Overlay Mask Register 9 */
#define CPU_OMASK9 0x84

/** \brief  0, , type: Ifx_CPU_OSEL, CPU Overlay Range Select Register */
#define CPU_OSEL 0x0

/** \brief  14, , type: Ifx_CPU_OTAR0, CPU Overlay Target Address Register 0 */
#define CPU_OTAR0 0x14

/** \brief  20, , type: Ifx_CPU_OTAR1, CPU Overlay Target Address Register 1 */
#define CPU_OTAR1 0x20

/** \brief  8C, , type: Ifx_CPU_OTAR10, CPU Overlay Target Address Register 10 */
#define CPU_OTAR10 0x8C

