Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  98, , type: Ifx_CPU_OTAR11, CPU Overlay Target Address Register 11 */
#define CPU_OTAR11 0x98

/** \brief  A4, , type: Ifx_CPU_OTAR12, CPU Overlay Target Address Register 12 */
#define CPU_OTAR12 0xA4

/** \brief  B0, , type: Ifx_CPU_OTAR13, CPU Overlay Target Address Register 13 */
#define CPU_OTAR13 0xB0

/** \brief  BC, , type: Ifx_CPU_OTAR14, CPU Overlay Target Address Register 14 */
#define CPU_OTAR14 0xBC

/** \brief  C8, , type: Ifx_CPU_OTAR15, CPU Overlay Target Address Register 15 */
#define CPU_OTAR15 0xC8

/** \brief  D4, , type: Ifx_CPU_OTAR16, CPU Overlay Target Address Register 16 */
#define CPU_OTAR16 0xD4

/** \brief  E0, , type: Ifx_CPU_OTAR17, CPU Overlay Target Address Register 17 */
#define CPU_OTAR17 0xE0

/** \brief  EC, , type: Ifx_CPU_OTAR18, CPU Overlay Target Address Register 18 */
#define CPU_OTAR18 0xEC

/** \brief  F8, , type: Ifx_CPU_OTAR19, CPU Overlay Target Address Register 19 */
#define CPU_OTAR19 0xF8

/** \brief  2C, , type: Ifx_CPU_OTAR2, CPU Overlay Target Address Register 2 */
#define CPU_OTAR2 0x2C

/** \brief  104, , type: Ifx_CPU_OTAR20, CPU Overlay Target Address Register 20 */
#define CPU_OTAR20 0x104

/** \brief  110, , type: Ifx_CPU_OTAR21, CPU Overlay Target Address Register 21 */
#define CPU_OTAR21 0x110

/** \brief  11C, , type: Ifx_CPU_OTAR22, CPU Overlay Target Address Register 22 */
#define CPU_OTAR22 0x11C

/** \brief  128, , type: Ifx_CPU_OTAR23, CPU Overlay Target Address Register 23 */
#define CPU_OTAR23 0x128

/** \brief  134, , type: Ifx_CPU_OTAR24, CPU Overlay Target Address Register 24 */
#define CPU_OTAR24 0x134

/** \brief  140, , type: Ifx_CPU_OTAR25, CPU Overlay Target Address Register 25 */
#define CPU_OTAR25 0x140

/** \brief  14C, , type: Ifx_CPU_OTAR26, CPU Overlay Target Address Register 26 */
#define CPU_OTAR26 0x14C

/** \brief  158, , type: Ifx_CPU_OTAR27, CPU Overlay Target Address Register 27 */
#define CPU_OTAR27 0x158

/** \brief  164, , type: Ifx_CPU_OTAR28, CPU Overlay Target Address Register 28 */
#define CPU_OTAR28 0x164

/** \brief  170, , type: Ifx_CPU_OTAR29, CPU Overlay Target Address Register 29 */
#define CPU_OTAR29 0x170

/** \brief  38, , type: Ifx_CPU_OTAR3, CPU Overlay Target Address Register 3 */
#define CPU_OTAR3 0x38

/** \brief  17C, , type: Ifx_CPU_OTAR30, CPU Overlay Target Address Register 30 */
#define CPU_OTAR30 0x17C

/** \brief  188, , type: Ifx_CPU_OTAR31, CPU Overlay Target Address Register 31 */
#define CPU_OTAR31 0x188

/** \brief  44, , type: Ifx_CPU_OTAR4, CPU Overlay Target Address Register 4 */
#define CPU_OTAR4 0x44

/** \brief  50, , type: Ifx_CPU_OTAR5, CPU Overlay Target Address Register 5 */
#define CPU_OTAR5 0x50

/** \brief  5C, , type: Ifx_CPU_OTAR6, CPU Overlay Target Address Register 6 */
#define CPU_OTAR6 0x5C

/** \brief  68, , type: Ifx_CPU_OTAR7, CPU Overlay Target Address Register 7 */
#define CPU_OTAR7 0x68

/** \brief  74, , type: Ifx_CPU_OTAR8, CPU Overlay Target Address Register 8 */
#define CPU_OTAR8 0x74

/** \brief  80, , type: Ifx_CPU_OTAR9, CPU Overlay Target Address Register 9 */
#define CPU_OTAR9 0x80

/** \brief  1FE08, , type: Ifx_CPU_PC, CPU Program Counter */
#define CPU_PC 0xFE08

/** \brief  1920C, , type: Ifx_CPU_PCON0, CPU Program Control 0 */
#define CPU_PCON0 0x920C

/** \brief  19204, , type: Ifx_CPU_PCON1, CPU Program Control 1 */
#define CPU_PCON1 0x9204

/** \brief  19208, , type: Ifx_CPU_PCON2, CPU Program Control 2 */
#define CPU_PCON2 0x9208

/** \brief  1FE00, , type: Ifx_CPU_PCXI, CPU Previous Context Information
 * Register */
#define CPU_PCXI 0xFE00

/** \brief  19210, , type: Ifx_CPU_PIEAR, CPU Program Integrity Error Address
 * Register */
#define CPU_PIEAR 0x9210

/** \brief  19214, , type: Ifx_CPU_PIETR, CPU Program Integrity Error Trap
 * Register */
#define CPU_PIETR 0x9214

/** \brief  18100, , type: Ifx_CPU_PMA0, CPU Data Access CacheabilityRegister */
#define CPU_PMA0 0x8100

/** \brief  18104, , type: Ifx_CPU_PMA1, CPU Code Access CacheabilityRegister */
#define CPU_PMA1 0x8104

/** \brief  18108, , type: Ifx_CPU_PMA2, CPU Peripheral Space Identifier
 * register */
#define CPU_PMA2 0x8108

/** \brief  19200, , type: Ifx_CPU_PSTR, CPU Program Synchronous Trap Register */
#define CPU_PSTR 0x9200

/** \brief  1FE04, , type: Ifx_CPU_PSW, CPU Program Status Word */
#define CPU_PSW 0xFE04

/** \brief  10, , type: Ifx_CPU_RABR0, CPU Redirected Address Base Register 0 */
#define CPU_RABR0 0x10

/** \brief  1C, , type: Ifx_CPU_RABR1, CPU Redirected Address Base Register 1 */
#define CPU_RABR1 0x1C

/** \brief  88, , type: Ifx_CPU_RABR10, CPU Redirected Address Base Register 10 */
#define CPU_RABR10 0x88

/** \brief  94, , type: Ifx_CPU_RABR11, CPU Redirected Address Base Register 11 */
#define CPU_RABR11 0x94

/** \brief  A0, , type: Ifx_CPU_RABR12, CPU Redirected Address Base Register 12 */
#define CPU_RABR12 0xA0

/** \brief  AC, , type: Ifx_CPU_RABR13, CPU Redirected Address Base Register 13 */
#define CPU_RABR13 0xAC

/** \brief  B8, , type: Ifx_CPU_RABR14, CPU Redirected Address Base Register 14 */
#define CPU_RABR14 0xB8

/** \brief  C4, , type: Ifx_CPU_RABR15, CPU Redirected Address Base Register 15 */
#define CPU_RABR15 0xC4

/** \brief  D0, , type: Ifx_CPU_RABR16, CPU Redirected Address Base Register 16 */
#define CPU_RABR16 0xD0

/** \brief  DC, , type: Ifx_CPU_RABR17, CPU Redirected Address Base Register 17 */
#define CPU_RABR17 0xDC

/** \brief  E8, , type: Ifx_CPU_RABR18, CPU Redirected Address Base Register 18 */
#define CPU_RABR18 0xE8

/** \brief  F4, , type: Ifx_CPU_RABR19, CPU Redirected Address Base Register 19 */
#define CPU_RABR19 0xF4

/** \brief  28, , type: Ifx_CPU_RABR2, CPU Redirected Address Base Register 2 */
#define CPU_RABR2 0x28

/** \brief  100, , type: Ifx_CPU_RABR20, CPU Redirected Address Base Register 20 */
#define CPU_RABR20 0x100

/** \brief  10C, , type: Ifx_CPU_RABR21, CPU Redirected Address Base Register 21 */
#define CPU_RABR21 0x10C

/** \brief  118, , type: Ifx_CPU_RABR22, CPU Redirected Address Base Register 22 */
#define CPU_RABR22 0x118

