Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCpu_reg.h
/** \brief  124, , type: Ifx_CPU_RABR23, CPU Redirected Address Base Register 23 */
#define CPU_RABR23 0x124

/** \brief  130, , type: Ifx_CPU_RABR24, CPU Redirected Address Base Register 24 */
#define CPU_RABR24 0x130

/** \brief  13C, , type: Ifx_CPU_RABR25, CPU Redirected Address Base Register 25 */
#define CPU_RABR25 0x13C

/** \brief  148, , type: Ifx_CPU_RABR26, CPU Redirected Address Base Register 26 */
#define CPU_RABR26 0x148

/** \brief  154, , type: Ifx_CPU_RABR27, CPU Redirected Address Base Register 27 */
#define CPU_RABR27 0x154

/** \brief  160, , type: Ifx_CPU_RABR28, CPU Redirected Address Base Register 28 */
#define CPU_RABR28 0x160

/** \brief  16C, , type: Ifx_CPU_RABR29, CPU Redirected Address Base Register 29 */
#define CPU_RABR29 0x16C

/** \brief  34, , type: Ifx_CPU_RABR3, CPU Redirected Address Base Register 3 */
#define CPU_RABR3 0x34

/** \brief  178, , type: Ifx_CPU_RABR30, CPU Redirected Address Base Register 30 */
#define CPU_RABR30 0x178

/** \brief  184, , type: Ifx_CPU_RABR31, CPU Redirected Address Base Register 31 */
#define CPU_RABR31 0x184

/** \brief  40, , type: Ifx_CPU_RABR4, CPU Redirected Address Base Register 4 */
#define CPU_RABR4 0x40

/** \brief  4C, , type: Ifx_CPU_RABR5, CPU Redirected Address Base Register 5 */
#define CPU_RABR5 0x4C

/** \brief  58, , type: Ifx_CPU_RABR6, CPU Redirected Address Base Register 6 */
#define CPU_RABR6 0x58

/** \brief  64, , type: Ifx_CPU_RABR7, CPU Redirected Address Base Register 7 */
#define CPU_RABR7 0x64

/** \brief  70, , type: Ifx_CPU_RABR8, CPU Redirected Address Base Register 8 */
#define CPU_RABR8 0x70

/** \brief  7C, , type: Ifx_CPU_RABR9, CPU Redirected Address Base Register 9 */
#define CPU_RABR9 0x7C

/** \brief  11030, , type: Ifx_CPU_SEGEN, CPU SRI Error Generation Register */
#define CPU_SEGEN 0x1030

/** \brief  1FD10, , type: Ifx_CPU_SWEVT, CPU Software Debug Event */
#define CPU_SWEVT 0xFD10

/** \brief  1FE14, , type: Ifx_CPU_SYSCON, CPU System Configuration Register */
#define CPU_SYSCON 0xFE14

/** \brief  18004, , type: Ifx_CPU_TASK_ASI, CPU Task Address Space Identifier
 * Register */
#define CPU_TASK_ASI 0x8004

/** \brief  1E400, , type: Ifx_CPU_TPS_CON, CPU Temporal Protection System
 * Control Register */
#define CPU_TPS_CON 0xE400

/** \brief  1E448, , type: Ifx_CPU_TPS_EXTIM_CLASS_EN, CPU Exception Timer Class
 * Enable Register */
#define CPU_TPS_EXTIM_CLASS_EN 0xE448

/** \brief  1E444, , type: Ifx_CPU_TPS_EXTIM_CVAL, CPU Exception Timer Current
 * Value */
#define CPU_TPS_EXTIM_CVAL 0xE444

/** \brief  1E450, , type: Ifx_CPU_TPS_EXTIM_FCX, CPU Exception Timer Status
 * Register */
#define CPU_TPS_EXTIM_FCX 0xE450

/** \brief  1E440, , type: Ifx_CPU_TPS_EXTIM_LVAL, CPU Exception Timer Load
 * Value */
#define CPU_TPS_EXTIM_LVAL 0xE440

/** \brief  1E44C, , type: Ifx_CPU_TPS_EXTIM_STAT, CPU Exception Timer Status
 * Register */
#define CPU_TPS_EXTIM_STAT 0xE44C

/** \brief  1E404, , type: Ifx_CPU_TPS_TIMER, CPU Temporal Protection System
 * Timer Register */
#define CPU_TPS_TIMER0 0xE404

/** \brief  1E408, , type: Ifx_CPU_TPS_TIMER, CPU Temporal Protection System
 * Timer Register */
#define CPU_TPS_TIMER1 0xE408

/** \brief  1E40C, , type: Ifx_CPU_TPS_TIMER, CPU Temporal Protection System
 * Timer Register */
#define CPU_TPS_TIMER2 0xE40C

/** \brief  1F004, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR0_ADR 0xF004

/** \brief  1F000, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR0_EVT 0xF000

/** \brief  1F00C, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR1_ADR 0xF00C

/** \brief  1F008, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR1_EVT 0xF008

/** \brief  1F014, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR2_ADR 0xF014

/** \brief  1F010, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR2_EVT 0xF010

/** \brief  1F01C, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR3_ADR 0xF01C

/** \brief  1F018, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR3_EVT 0xF018

/** \brief  1F024, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR4_ADR 0xF024

/** \brief  1F020, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR4_EVT 0xF020

/** \brief  1F02C, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR5_ADR 0xF02C

/** \brief  1F028, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR5_EVT 0xF028

/** \brief  1F034, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR6_ADR 0xF034

/** \brief  1F030, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR6_EVT 0xF030

/** \brief  1F03C, , type: Ifx_CPU_TR_ADR, CPU Trigger Address */
#define CPU_TR7_ADR 0xF03C

/** \brief  1F038, , type: Ifx_CPU_TR_EVT, CPU Trigger Event */
#define CPU_TR7_EVT 0xF038

/** \brief  1FD30, , type: Ifx_CPU_TRIG_ACC, CPU Trigger Address x */
#define CPU_TRIG_ACC 0xFD30

/** \brief  1D040, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR8_L 0xD040

/** \brief  1D044, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR8_U 0xD044

/** \brief  1D048, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR9_L 0xD048

/** \brief  1D04C, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR9_U 0xD04C

/** \}  */

/******************************************************************************/
/******************************************************************************/
#endif /* IFXCPU_REG_H */
